{"date": "20.05.2020", "scrape_data": {"Andorra": {"published_date": "12.05.2020", "ISO2": "AD", "info": "Please see Coronavirus (COVID-19) regulations for France or Spain, whichever is transited to enter Andorra.", "possible_bannees": ["FR", "ES"]}, "United Arab Emirates": {"published_date": "19.04.2020", "ISO2": "AE", "info": "1. Flights to the United Arab Emirates are suspended.- This does not apply to the following:- aircraft operated for the purpose of evacuation (this Safety Decision does not alleviate the need for obtaining necessary authorisation from UAE Ministry of Foreign Affairs and International Cooperation);- UAE registered aircraft that are out of base on 24 March 2020 23:59 Local Time will be allowed to return to base carrying only UAE nationals and operator’s crewmembers;- over-flights. 2. All Evacuation flights must have PAX APP data and Crew APP data; all ferry flights must have crew APP data.", "possible_bannees": []}, "Afghanistan": {"published_date": "24.04.2020", "ISO2": "AF", "info": "Flights to Afghanistan are suspended.- This does not apply to repatriation flights that bring back nationals of Afghanistan.", "possible_bannees": []}, "Antigua and Barbuda": {"published_date": "23.04.2020", "ISO2": "AG", "info": "1. Flights to Antigua and Barbuda are suspended.- This does not apply to flights with a special approval.2. Passengers must be quarantined for 14 days. - This does not apply to passengers arriving from the Dominican Rep. 3. Passengers arriving from the Dominican Rep. must undergo a 14 days quarantine before departure, and a 14 days quarantine upon arrival in Antigua and Barbuda. ", "possible_bannees": ["DM"]}, "Anguilla": {"published_date": "07.04.2020", "ISO2": "AI", "info": "Airports in Anguilla are closed. ", "possible_bannees": []}, "Albania": {"published_date": "29.04.2020", "ISO2": "AL", "info": "Flights to Albania are suspended.- This does not apply to flights operated by Air Albania (ZB) from/to Istanbul (IST).- This does not apply to repatriation and emergency flights. ", "possible_bannees": []}, "Armenia": {"published_date": "17.04.2020", "ISO2": "AM", "info": "1. Passengers are not allowed to enter Armenia.- This does not apply to:- nationals and residents of Armenia;- immediate family members of nationals of Armenia;- diplomats and their immediate family members.2. Passengers who are allowed to enter Armenia are subject to a 14 day quarantine.", "possible_bannees": []}, "Angola": {"published_date": "07.05.2020", "ISO2": "AO", "info": "1. Passengers who have been in China (People's Rep.), France, Iran, Italy, Korea (Rep.), Portugal or Spain are not allowed to enter Angola. - This does not apply to nationals and residents of Angola.2. Airline crew, nationals and residents of Angola who arrive from or have been in China (People's Rep.), France, Iran, Italy, Korea (Rep.), Portugal or Spain will be put in quarantine. 3. A completed sanitary control sheet must be presented to the Ministry of Health upon arrival.", "possible_bannees": ["CN", "FR", "IT", "PT", "ES"]}, "Argentina": {"published_date": "11.05.2020", "ISO2": "AR", "info": "1. Passengers are not allowed to enter Argentina.- This does not apply to nationals and residents of Argentina.2. Airlines must send airline crew and passenger's information to ANAC 12 hours before departure. This information must contain passenger list with travel document numbers, phone number and address where each person declares that they will comply with the mandatory quarantine upon arrival.", "possible_bannees": []}, "American Samoa": {"published_date": "18.03.2020", "ISO2": "AS", "info": "1.Nationals of the USA and residents of Samoa (American) who transited or have been in Arizona, California, Florida, Georgia, Hawaii, Illinois, Massachusetts, New Hampshire, New York, North Carolina, Oregon, Rhode Island, Texas, Washington or Wisconsin, are subject to Public Health screening and might be medically or home quarantined. 2.Entry Permits, issued by Samoa (American) instead of visas, are suspended. - This does not apply to residents of Samoa (American) with residence permit or an Immigration Board approval.3.Passengers arriving from Samoa must:- obtain a health clearance from Ministry of Health (MOH) 3 days prior to arrival; - present a completed “DOT Travel Declaration Form\" upon arrival.4.Passengers who transited or have been in countries affected by Coronavirus (COVID-19), when arriving from Hawaii, must: -spend 14 days in Hawaii; and-obtain a health clearance 3 days before arrival in Samoa (American); and-present a completed “DOT Travel Declaration Form\" upon arrival; and-provide itinerary upon arrival.", "possible_bannees": ["GE", "WS"]}, "Austria": {"published_date": "18.04.2020", "ISO2": "AT", "info": "1. Passengers arriving from a non-Schengen Member State are not allowed to enter Austria. - This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland. - This does not apply to passengers with a British passport. - This does not apply to residents of Austria. - This does not apply to passengers with a \"D\" visa issued by Austria. - This does not apply to passengers with a medical certificate dated from a maximum of 4 days before their arrival in Austria. The medical certificate must confirm that the person is not affected by Coronavirus (COVID-19), and be in German or in English. - This does not apply to:a. passengers traveling on diplomatic missions and their family members if living in the same household, andb. employees of international organisations and their family members if living in the same household, andc. humanitarian workers, and d. healthcare professionals, ande. crew members of emergency, rescue/ambulance or ferry flights. 2. Nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland must self-quarantine for 14 days and this must be confirmed by signature. This does not apply if their immediate departure is ensured. 3. Passengers with a British passport must self-quarantine for 14 days and this must be confirmed by signature. This does not apply if their immediate departure is ensured.4. Residents of Austria and passengers with a \"D\" visa issued by Austria must self-quarantine for 14 days and this must be confirmed by signature. This does not apply if their immediate departure is ensured.", "possible_bannees": ["BE", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GR", "HU", "IS", "IE", "IT", "LV", "LI", "LT", "LU", "MT", "NO", "PL", "PT", "RO", "SK", "SI", "ES", "SE", "CH"]}, "Australia": {"published_date": "19.05.2020", "ISO2": "AU", "info": "1. Passengers are not allowed to enter Australia. - This does not apply to nationals of Australia. - This does not apply to the immediate family members of nationals of Australia. - This does not apply to permanent residents of Australia and their immediate family members. - This does not apply to nationals of New Zealand residing in Australia. - This does not apply to diplomats accredited to Australia and currently resident in Australia, and their immediate family members.- This does not apply to nationals of Fiji, Kiribati, Marshall Isl., Micronesia (Federated States), Nauru, New Zealand, Niue, Palau, Papua New Guinea, Samoa (American), Solomon Isl., Tonga, Tuvalu and Vanuatu when they are transiting through Australia with a confirmed onward ticket for a flight to depart Australia within 72 hours of the arriving flight.- This does not apply to passengers who reside in Cook Isl., French Polynesia or New Caledonia when they are transiting through Australia with a confirmed onward ticket for a flight to depart Australia within 72 hours of the arriving flight.2. Passengers and airline crew are required to self-isolate for a period of 14 days at their first arrival location in Australia. If their duration of stay is less than 14 days, they must self-isolate for the entire duration of stay.- This does not apply to airline crew with the appropriate personal protective equipment.3. Airline crew who are nationals or residents of Australia must self-isolate at their place of residence (or hotel) between flights, or for 14 days, whichever is shorter.Airline crew who are not nationals or residents of Australia must self-isolate in their hotel on arrival until their next flight.4. For repatriation charter flights, airlines are advised to contact the Australian Border Force (ABF) as early as possible in the planning process. Airlines should not confirm or schedule flights before discussing arrangements with the ABF repatriation team.", "possible_bannees": ["FJ", "PF", "GN", "KI", "NR", "NC", "NZ", "NU", "PW", "PG", "WS", "TO", "TV", "VU"]}, "Aruba": {"published_date": "21.04.2020", "ISO2": "AW", "info": "Passengers are not allowed to enter Aruba. - This does not apply to:- legal residents of Aruba with prior authorization;- special circumstances to non-resident passengers which are granted upon request . e.g. medical personnel;- medevac flights, humanitarian flights, transit/transfer flights with prior approval from the DCA Aruba.", "possible_bannees": []}, "Azerbaijan": {"published_date": "22.03.2020", "ISO2": "AZ", "info": "1. Passengers are not allowed to enter Azerbaijan.- This does not apply to nationals and residents of Azerbaijan.- This does not apply to passengers with a work permit issued by Azerbaijan.- This does not apply to passengers with a special permission issued by the government of Azerbaijan.2. A completed Public Health Passenger Locator Form must be presented upon arrival.3. Passengers will be tested for Coronavirus (COVID-19) and placed in quarantine for 14 days.4. The issuance of e-visas and visa on arrival has been suspended.", "possible_bannees": []}, "Bosnia and Herzegovina": {"published_date": "27.03.2020", "ISO2": "BA", "info": "Passengers are not allowed to enter Bosnia and Herzegovina.This does not apply to:-nationals and residents of Bosnia and Herzegovina-diplomatic and consular staff accredited in Bosnia and Herzegovina-civil servants coming for employment-passengers in need of emergency medical treatment-cross-border workers-civilian protection services and teams-military forces of the NATO and other states participating in the partnership for Peace; and to NATO and EUFOR headquarters in Bosnia and Herzegovina-heads of state and members of their delegations whose arrival and departure has been announced by the competent authority-passengers in transit to return to the country of residence-passengers with a special permit to stay or transit in Bosnia and Herzegovina.", "possible_bannees": []}, "Barbados": {"published_date": "17.04.2020", "ISO2": "BB", "info": "Barbados (BGI) is closed. - This does not apply to Medevac flights, technical stops, and authorized flights, e.g. humanitarian aid.", "possible_bannees": []}, "Bangladesh": {"published_date": "06.05.2020", "ISO2": "BD", "info": "1. The visa on arrival facility has been suspended for all nationalities.2. Flights from Bahrain, Bhutan, Hong Kong (SAR China), India, Kuwait, Malaysia, Maldives, Nepal, Oman, Qatar, Saudi Arabia, Sri Lanka, Singapore, Thailand, Turkey, United Arab Emirates and the United Kingdom are suspended.3. Passengers who have a valid visa must show a medical certificate (with English translation) obtained within 72 hours of travel. The medical certificate must be submitted upon arrival and must indicate that the passenger does not have any symptoms of Coronavirus (COVID-19).4. Passengers with Bangladesh origin who do not submit a medical certificate stating that the passenger does not have any symptoms of Coronavirus (COVID-19), will be institutionally quarantined in Dhaka for 14 days.5. Passengers with Bangladesh origin who submits a medical certificate stating that the passenger does not have any symptoms of Coronavirus (COVID-19), will be home quarantined in Dhaka for 14 days. If the medical certificate shows that the passenger has symptoms of Coronavirus (COVID-19), they will be institutionally quarantined in Dhaka for 14 days.", "possible_bannees": ["BH", "BT", "CN", "HK", "IN", "KW", "MY", "MV", "NP", "OM", "QA", "SA", "SG", "LK", "TH", "TR"]}, "Belgium": {"published_date": "07.05.2020", "ISO2": "BE", "info": "1. Passengers are not allowed to enter Belgium.This does not apply to:- Passengers arriving from an EEA Member States, Switzerland or the United Kingdom.- Nationals of EEA Member States and Switzerland, returning home.- British nationals returning home.- Nationals of Andorra, Monaco, Montenegro, North Macedonia (Rep.), San Marino, Serbia and Vatican City (Holy See) with proof of connection travel to their home country.- Passengers with a long term residence permit or a long term “D\" visa issued by EEA Member States, Switzerland or the United Kingdom, returning home.- Family members of nationals of EEA Member States, Switzerland and of British nationals, returning home;- Diplomats;- Personnel of international and humanitarian organizations;- Humanitarian aid workers;- Military personnel.2. Passenger flights are only allowed to operate between 7:00 and 21:00.- This does not apply to humanitarian, repatriation and United Nations flights.3. Belgium temporarily reintroduced border controls.", "possible_bannees": ["AD", "MC", "ME", "SM", "RS", "CH"]}, "Burkina Faso": {"published_date": "18.04.2020", "ISO2": "BF", "info": "Bobo Dioulasso (BOY) and Ouagadougou (OUA) airports are closed.", "possible_bannees": []}, "Bulgaria": {"published_date": "07.05.2020", "ISO2": "BG", "info": "1. Passengers not arriving from Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, Greece, Hungary, Latvia, Lithuania, Malta, Norway, Poland, Portugal, Romania, Slovakia, Slovenia or Sweden are not allowed to enter Bulgaria. - This does not apply to nationals of Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, Greece, Hungary, Latvia, Lithuania, Malta, Norway, Poland, Portugal, Romania, Slovakia, Slovenia and Sweden. - This does not apply to family members of nationals of Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, Greece, Hungary, Latvia, Lithuania, Malta, Norway, Poland, Portugal, Romania, Slovakia, Slovenia and Sweden.- This does not apply to passengers and their families with a permanent or long term residence permit issued by Bulgaria. - This does not apply to nationals of Austria, Belgium, France, Germany, Iceland, Ireland (Rep.), Italy, Liechtenstein, Luxembourg, Netherlands, Spain and Switzerland and their family members when they transit through Bulgaria to return to their country of residence. - This does not apply to passengers with a British passport and their family members when they transit through Bulgaria to return to their country of residence. - This does not apply to nationals and residents of Turkey when they transit through Bulgaria to return to their country of residence. - This does not apply to nationals and residents of North Macedonia (Rep.) when they transit through Bulgaria to return to their country of residence.- This does not apply to nationals and residents of Serbia when they transit through Bulgaria to return to their country of residence. - This does not apply to nationals and residents of Montenegro when they transit through Bulgaria to return to their country of residence.- This does not apply to the following passengers:a. health care professionals, health researchers and elderly care professionals;b. transport personnel engaged in the carriage of goods, crews of aircraft engaged in commercial air transport and other transport personnel as necessary;c. diplomats, officials of international organizations, military personnel and humanitarian workers in the performance of their duties;d. persons traveling for humanitarian reasons; third-country nationals who hold a long-term residence permit in an EU Member State and pass through Bulgaria in order to return to their country of residence and residence.2. Nationals of Bulgaria arriving from risky countries are requested to observe a 14-day quarantine period.3. All arriving passenger from Italy at Sofia airport (SOF) must fill out a questionnaire in the presence of a health inspector.4. All passports and national ID cards issued to nationals of Bulgaria and which have expired on 13 March 2020 or later, are considered valid with a prolongation of 6 months. This is due to the Coronavirus (COVID-19) Pandemic.", "possible_bannees": ["AT", "BE", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GR", "HU", "IS", "IE", "IT", "LV", "LI", "LT", "LU", "MT", "ME", "NO", "PL", "PT", "RO", "RS", "SK", "SI", "ES", "SE", "CH", "TR"]}, "Bahrain": {"published_date": "19.03.2020", "ISO2": "BH", "info": "1. Visa on arrival has been suspended.- This does not apply to passengers with a diplomatic, an official, a service or UN passport.2. Passengers who have been in Austria, Belgium, China (People's Rep.), Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Iraq, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom and USA in the past 14 days are not allowed to transit and enter Bahrain. - This does not apply to nationals of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and United Arab Emirates. - This does not apply to passengers who reside in Bahrain.- This does not apply to military personnel. - This does not apply to passengers with a special approval from Nationality, Passport Residence Affairs Directorate of Bahrain. - This does not apply to passengers with a valid letter of Prior Permission Granted which is presented prior to boarding. 3. Passengers who have been in Hong Kong (SAR China), Italy, Japan, Lebanon, Malaysia, Singapore or Thailand in the past 14 days must have a valid visa prior to arrival. - This does not apply to nationals of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and United Arab Emirates. - This does not apply to passengers who reside in Bahrain. - This does not apply to passengers with a valid letter of Prior Permission Granted which is presented prior to boarding.4. All passengers arriving in Bahrain will immediately be taken to undergo enhanced testing procedures as a preventative measure for Coronavirus (COVID-19) and will be subject to quarantine.5. Border crossing on the causeway has been temporarily suspended due to Coronavirus (COVID-19). ", "possible_bannees": ["AT", "BE", "CN", "CZ", "DK", "EE", "FI", "FR", "DE", "GR", "HK", "HU", "IS", "IQ", "IT", "JP", "KW", "LV", "LB", "LI", "LT", "LU", "MY", "MT", "NO", "OM", "PL", "PT", "QA", "SA", "SG", "SK", "SI", "ES", "SE", "CH", "TH"]}, "Burundi": {"published_date": "21.04.2020", "ISO2": "BI", "info": "Flights to Burundi are suspended.", "possible_bannees": []}, "Benin": {"published_date": "15.05.2020", "ISO2": "BJ", "info": "Passengers arriving in Cotonou (COO) will be tested for Coronavirus (COVID-19) on arrival at their own expense. They will be subject to quarantine for 14 days. ", "possible_bannees": []}, "Bermuda": {"published_date": "18.04.2020", "ISO2": "BM", "info": "Passengers are not allowed to enter Bermuda.- This does not apply to nationals and residents of Bermuda. - This does not apply to passengers with a written permission of the Quarantine Authority of Bermuda.", "possible_bannees": []}, "Brunei Darussalam": {"published_date": "20.04.2020", "ISO2": "BN", "info": "1. Passengers are not allowed to transit or enter Brunei Darussalam.- This does not apply to nationals and residents of Brunei Darussalam.2. All visa exemptions and Visa on Arrival are temporarily suspended.3. All visa issued to passengers are temporarily suspended.4. Special consideration is only given by the Brunei Immigration Department which is subject to the affairs of interest to Brunei Darussalam by applying to the Brunei Immigration Department by downloading the form provided on the Department’s website at www.immigration.gov.bn . Passengers with a Special consideration are subject to Coronavirus (COVID-19) testing that has a cost of BND1000.", "possible_bannees": []}, "Bolivia, Plurinational State of": {"published_date": "01.05.2020", "ISO2": "BO", "info": "Bolivia's borders are closed.", "possible_bannees": []}, "Bonaire, Sint Eustatius and Saba": {"published_date": "16.04.2020", "ISO2": "BQ", "info": "Passengers arriving from Austria, Belgium, Bulgaria, Canada, China (People's Rep.), Colombia, Croatia, Cyprus, Czechia, Denmark, Dominican Rep., Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom or USA are not allowed to enter Bonaire, St. Eustatius and Saba. - This does not apply to medical staff and patients who are transferred in the interest of public health on Bonaire, St. Eustatius and Saba. ", "possible_bannees": ["AT", "BE", "BG", "CA", "CN", "CO", "HR", "CY", "CZ", "DK", "DM", "EE", "FI", "FR", "DE", "GR", "HU", "IS", "IE", "IT", "LV", "LI", "LT", "LU", "MT", "NO", "PL", "PT", "RO", "SK", "SI", "ES", "SE", "CH"]}, "Brazil": {"published_date": "15.05.2020", "ISO2": "BR", "info": "Passengers are not allowed to enter Brazil.- This does not apply to:  - nationals and residents of Brazil;  - immediate family member of a national of Brazil. Spouses of a national of Brazil must have a Brazilian marriage certificate. If the certificate is not issued by Brazil, it must be apostilled by a consulate. A non-official translation in Portuguese is also required;  - passengers with an authorization issued by Brazilian Government;  - passengers with a National Migration Registry;  - technical landing to refuel where passengers of restricted nationalities are not disembarking;  - passengers in international transit if they do not leave the international area of the airport and the country of destination admits their entry.", "possible_bannees": []}, "Bahamas": {"published_date": "17.04.2020", "ISO2": "BS", "info": "Bahamas borders are closed. ", "possible_bannees": []}, "Bhutan": {"published_date": "20.04.2020", "ISO2": "BT", "info": "1. Visa on arrival is suspended.2. Passengers with a visa, work permit or other immigration permits issued by Bhutan and airline crew are not allowed to enter Bhutan if they arrive from or have visited or transited through a Coronavirus (COVID-19) affected country.3. Airline crew are subject to thermal screening on arrival.", "possible_bannees": []}, "Botswana": {"published_date": "18.04.2020", "ISO2": "BW", "info": "1. Passengers arriving from Austria, Belgium, China (People's Rep.), Denmark, France, Germany, India, Iran, Italy, Japan, Korea (Rep.), Netherlands, Norway, Spain, Sweden, Switzerland, USA or United Kingdom are not allowed to enter Botswana.- This does not apply to nationals and residents of Botswana.2. Nationals and residents of Botswana will be quarantined for 14 days.3. Passengers can no longer obtain a visa on arrival in Botswana.. 4. Visas issued to nationals of Austria, Belgium, China (People's Rep.), Denmark, France, Germany, India, Iran, Italy, Japan, Korea (Rep.), Netherlands, Norway, Spain, Sweden, Switzerland or USA are invalidated.5. Visas issued to passengers with a British passport with nationality \"British Citizen\" are invalidated.", "possible_bannees": ["AT", "BE", "CN", "DK", "FR", "DE", "IN", "IT", "JP", "NO", "ES", "SE", "CH"]}, "Belarus": {"published_date": "04.05.2020", "ISO2": "BY", "info": "A completed awareness questionnaire must be presented upon arrival and passengers must self-isolate for 14 days.- This does not apply to passengers in transit. ", "possible_bannees": []}, "Belize": {"published_date": "21.04.2020", "ISO2": "BZ", "info": "Airports in Belize are closed.", "possible_bannees": []}, "Canada": {"published_date": "06.05.2020", "ISO2": "CA", "info": "1. Passengers are not allowed to enter Canada.- This does not apply to nationals of Canada.- This does not apply to passengers arriving from the USA. They must travel for a non-discretionary or non-optional purpose.- This does not apply to permanent residents of Canada and their immediate family members.- This does not apply to diplomats.- This does not apply to seasonal agricultural workers, fish/seafood workers, caregivers and all other temporary foreign workers.- This does not apply to international students who held a valid study permit, or had been approved for a study permit, when the travel restrictions took effect on March 18, 2020.- This does not apply to permanent resident applicants who had been approved for permanent residence before the travel restrictions were announced on March 18, 2020, but who had not yet travelled to Canada.- This does not apply to immediate family members of nationals of Canada, which include:a. the spouse or common-law partner of the person;b. a dependent child of the person or of the person's spouse or common-law partner;c. a dependent child of a dependent child referred to in paragraph b;d. the parent or step-parent of the person or of the person's spouse or common-law partner; ore. the guardian or tutor of the person. (membre de la famille immediate).- This does not apply to the following passengers:a. Person registered as an Indian under the Indian Act;b. Person authorized in writing by a consular officer of the government of Canada to come to Canada to reunite with immediate family members;c. Person who is exempt from the requirements to obtain a temporary resident visa under paragraph 190 (2)(a) of the Immigration and Refugee Protection Regulations, and their immediate family members;d. Person who enters Canada at the invitation of the Minister of Health for the purpose of assisting in the COVID-19 response;e. Person who arrives by means of an aircraft operated by Canadian Forces or the Department of National Defence;f. Member of the Canadian Forces or a visiting force, as defined in section 2 of the Visiting Forces Act, and their immediate family members;g. Protected person, under section 95 (2) of the Immigration and Refugee Protection Act;h. French citizen who resides in Saint-Pierre-et-Miquelon;i. Person or class of persons that the Chief Public Health Officer, appointed under subsection 6 (1) of the Public Health Agency of Canada Act, determines does not pose a risk of significant harm to public health or who will provide an essential service while in Canada;j. Person whom the Minister of Foreign Affairs, the Minister of Citizenship and Immigration or the Minister of Public Safety and Emergency Preparedness determines their presence is in the national interest.2. Passengers with Coronavirus (COVID-19) symptoms are not allowed to board a plane to Canada. Passengers with Coronavirus (COVID-19) symptoms on arrival will be referred to Public Health Agency of Canada.3. Passengers who have been refused boarding in the past 14 days due to a medical reason related to Coronavirus (COVID-19) are not allowed to enter.4. Passengers must travel to Canada for essential purposes. Non-essential purposes include tourism, sightseeing, recreation, entertainment, social visits and religious functions.- This does not apply to nationals of Canada.- This does not apply to permanent residents of Canada.- This does not apply to persons registered as an Indian under the Indian Act.5. Passengers must have a quarantine plan upon arrival and are required to quarantine for a period of 14 days.6. Passengers who were in the cruise ship 'Diamond Princess' are subject to a mandatory 14-day isolation at a quarantine facility upon arrival in Canada.", "possible_bannees": ["IN"]}, "Congo, The Democratic Republic of the": {"published_date": "22.04.2020", "ISO2": "CD", "info": "1. Flights to Congo (Dem. Rep.) are suspended.- This does not apply to pre-approved repatriation flights.2. Passengers and airline crew must go through medical screening upon arrival and present a completed Health Sanitary Card provided by Health Authorities.", "possible_bannees": []}, "Central African Republic": {"published_date": "07.05.2020", "ISO2": "CF", "info": "Passengers arriving from a country with local transmission of Coronavirus (COVID-19) must self-quarantine for 21 days upon arrival.", "possible_bannees": []}, "Congo": {"published_date": "26.03.2020", "ISO2": "CG", "info": "Airports in Congo are closed.", "possible_bannees": []}, "Switzerland": {"published_date": "14.04.2020", "ISO2": "CH", "info": "1. Passengers are not allowed to enter Switzerland.- This does not apply to nationals or residents of Switzerland or Liechtenstein.- This does not apply to passenger with a cross-border commuter permit who are entering Switzerland for work, with a C-visa issued by Switzerland for the purpose of \"business meetings\" as specialists in the field of health or \"official visit\" of great importance, with a D-visa issued by Switzerland or who have an assurance of a residence permit.-This does not apply to passengers traveling directly through Switzerland to another country that they are permitted to enter.- This does not apply to passengers who are entitled to freedom of movement and have a professional reason for entering Switzerland and have a confirmation of registration.- This does not apply to passengers who are of great importance as specialists in the health sector.- This does not apply to passengers travelling by land to their country of origin or residency within the European Union or Schengen area. They must have a proof of onward journey.2. Passengers can only land at Basel (BSL), Geneva (GVA) or Zurich (ZRH).", "possible_bannees": ["LI"]}, "Côte d'Ivoire": {"published_date": "25.03.2020", "ISO2": "CI", "info": "Cote d'Ivoire borders are closed.", "possible_bannees": []}, "Cook Islands": {"published_date": "07.05.2020", "ISO2": "CK", "info": "Passengers and airline crew who have transited or have been in any country except for Cook Isl. and New Zealand in the past 14 days are not allowed to enter Cook Isl.Passengers who have transited or been in any country except for Cook Isl. and New Zealand in the past 14 days are not allowed to enter Cook Isl. - This does not apply to Cook Islanders and any immediate family member.- This does not apply to nationals of New Zealand and any immediate family member.- This does not apply to passengers who reside in Cook Isl. or New Zealand and any immediate family member.- This does not apply to nationals and residents of Australia who normally reside in New Zealand, and any immediate family member.- This does not apply to passengers with a work permit issued by Cook Isl. and any immediate family member.", "possible_bannees": ["AU", "NZ"]}, "Chile": {"published_date": "03.05.2020", "ISO2": "CL", "info": "1. Passengers are not allowed to enter Chile.This does not apply to:- nationals and residents of Chile;- passengers bringing humanitarian help;- passengers with a diplomatic visa and an official ID issued by the Ministry of Foreign Affairs of Chile;- passengers with a safe-conduct.2. Nationals and residents of Chile will be quarantined for 14 days.", "possible_bannees": []}, "Cameroon": {"published_date": "15.04.2020", "ISO2": "CM", "info": "All international flights to Cameroon are suspended.", "possible_bannees": []}, "China": {"published_date": "11.05.2020", "ISO2": "CN", "info": "1. The mainland of China has decided to temporarily suspend the entry into the mainland of China by foreign nationals holding visas or residence permits still valid to the time of this announcement, effective from 00:00 local time, 28 March 2020. Entry by foreign nationals with APEC Business Travel Cards will be suspended as well. - Policies including port visas, 24/72/144-hour visa-free transit policy, Hainan 30-day visa-free policy, 15-day visa-free policy specified for foreign cruise-group-tour through Shanghai Port, Guangdong 144-hour visa-free policy specified for foreign tour groups from Hong Kong or Macao SAR, and Guangxi 15-day visa-free policy specified for foreign tour groups of ASEAN countries will also be temporarily suspended. Entry with diplomatic, service, courtesy or C visas will not be affected. - Foreign nationals coming to the mainland of China for necessary economic, trade, scientific or technological activities or out of emergency humanitarian needs may apply for visas at Chinese embassies or consulates. - Entry by foreign nationals with visas issued after this announcement will not be affected.2. All passengers arriving at PEK will have a PCR test and be quarantined at the designated location in Beijing for 14 days. 3. Passengers arriving at Shanghai Pudong (PVG) or Shanghai Hongqiao (SHA) must undergo a Nucleic Acid Test (NAT) and a 14-day quarantine in designated places for medical observation.4. Passengers who live in or have been in France, Germany, Iran, Italy, Japan, Korea (Rep.), Spain or USA in the past 14 days arriving at Guangzhou (CAN) or Shenzhen (SZX) must undergo 14-day quarantine at home or in designated places for medical observation. All passengers arriving at SZX will have a PCR test.5. All passengers arriving at XMN will be quarantined for medical observation at the designated hotels for 14 days on their own expenses.- This does not apply to passengers under 18 years old, passengers above 70 years old, pregnant women and passengers suffering from illness. They must apply for permission to undergo a 14-day quarantine at home.6. Airline crew of foreign airlines:- are not required to undergo nucleic acid test if they have a short stay after landing then depart immediately, and do not leave apron during the transition; OR- shall receive nucleic acid test in the first port of entry if they need to enter the country to rest or continue to operate domestic routes. The test results will be confirmed by the local government in accordance with the requirements of epidemic prevention management. Only if the test results are negative, crews can continue the operations; OR- are allowed to return to their home country for isolation treatment when agreed by the local joint control mechanism, if they are symptomatic, in close contact with infected persons or tested positive. Airlines and crews shall make all commitments to bear their responsibilities and also carry out strict protections.", "possible_bannees": ["FR", "DE", "HK", "IT", "JP", "MO", "ES"]}, "Colombia": {"published_date": "09.04.2020", "ISO2": "CO", "info": "Flights to Colombia are suspended.", "possible_bannees": []}, "Costa Rica": {"published_date": "14.04.2020", "ISO2": "CR", "info": "1. Passengers are not allowed to enter Costa Rica. - This does not apply to nationals of Costa Rica.- This does not apply to passengers who have left Costa Rica before 26 March 2020 or after 30 April 2020 and have:a) Permanent residence in Costa Rica; orb) Temporary residence in Costa Rica; orc) Special category (Categoria Especial); ord) Non-resident subcategory Stay (No Residente subcategoria Estancia).2. Nationals and residents of Costa Rica must be in isolation for 14 days.", "possible_bannees": []}, "Cuba": {"published_date": "01.04.2020", "ISO2": "CU", "info": "Flights to Cuba are suspended.- This does not apply to humanitarian flights.", "possible_bannees": []}, "Cabo Verde": {"published_date": "22.04.2020", "ISO2": "CV", "info": "Flights to Cape Verde are suspended.- This does not apply to special, repatriation and humanitarian flights.", "possible_bannees": []}, "Curaçao": {"published_date": "08.05.2020", "ISO2": "CW", "info": "Passengers are not allowed to transit or enter Curacao.This does not apply to:- Residents of Curacao approved by the Government of Curacao. These passengers will have to show a verification letter from the Government of Curacao that they are allowed to travel to Curacao.- Medical specialist and other medical personnel if authorized by the Government of Curacao. These passengers must have a verification letter from the government of Curacao proving they are allowed to enter Curacao.- Persons deemed necessary or specifically approved by the Government of Curacao. These passengers must have a verification letter from the government of Curacao proving they are allowed to enter Curacao.- Passengers in transit who remain on board of the same aircraft or do wing to wing transit from one aircraft to another without entering the transit terminal. A minimum of 24 hours prior notice is required. ", "possible_bannees": []}, "Cyprus": {"published_date": "06.05.2020", "ISO2": "CY", "info": "1. Flights to Cyprus are suspended.- This does not apply to repatriation flights or empty aircraft arriving to transport persons wishing to leave Cyprus. 2. Nationals and residents of Cyprus are subject to a mandatory 14-day quarantine. ", "possible_bannees": []}, "Czechia": {"published_date": "13.05.2020", "ISO2": "CZ", "info": "Passengers are not allowed to enter Czechia.- This does not apply to nationals of Czechia.- This does not apply to passengers with a Czech long stay visa (D), Czech residence permit for stay over 90 days issued before 12.3.2020 or for permanent stay. Holders of long-stay visas (D, D/VR/XX in comment section of the visa) issued after 12.3.2020 must present another two documents: a laboratory confirmation of negative result of PCR test on COVID 19 and a medical confirmation of this negative result. These two documents may be replaced by the letter of a Minister of the Government of the Czech Republic granting exception. - This does not apply to members of the mission under the Vienna Convention on Diplomatic Relations and members of the consular posts under the Vienna Convention on Consular Relations accredited in Czechia, and officials of international organizations registered with Ministry of the Foreign Affairs of Czechia (EU, EU-GSA, EIB, IOM, OSCE, UNHCR, UN, WHO), including their spouses and children. A birth certificate or its copy and/or a marriage certificate must be presented together with a copy of the residence permit of the member of the mission issued by Czechia. In case the child/spouse is not a national of EU Member State, Iceland, Liechtenstein, Norway, Switzerland or United Kingdom or a national of EU visa free country, visa or residence permit must be presented. - This does not apply to passengers who are holders of one of the following documents and who present an official invitation:- United Nations laissez-passer issued to staff of the United Nations and subordinate agencies under the Convention on Privileges and Immunities of Specialised Agencies adopted -by the United Nations General Assembly on 21 November 1947 in New York;- European Union (EU) laissez-passer;- European Atomic Energy Community (Euratom) laissez-passer;- legitimacy certificate issued by the Secretary-General of the Council of Europe;- documents issued pursuant to paragraph 2 of Article III of the Agreement between the Parties to the North Atlantic Treaty regarding the Status of their Force (military ID cards accompanied by a travel order, travel warrant, or an individual or collective movement order) as well as documents issued in the framework of the Partnership for Peace.- This does not apply to nationals of another EU Member State, Andorra, Iceland, Liechtenstein, Monaco, Norway, San Marino Switzerland, United Kingdom or Vatican City (Holy See) with an official confirmation by an embassy of their home state or by an embassy of Czechia confirming acceptance to a flight for the purpose of repatriation to their home state and an organized transfer or their intention to transfer from the territory of Czechia to their home state. - This does not apply to passengers with a long-stay visa, residence permit for stay over 90 days or for permanent stay in another EU Member State, Andorra, Iceland, Liechtenstein, Monaco, Norway, San Marino Switzerland, United Kingdom or the Vatican City (Holy See) with an official confirmation by an embassy of the state which issued their residence permit or by an embassy of Czechia confirming acceptance to a flight for the purpose of repatriation and to an organized transfer or their intention to transfer from the territory of Czechia to their country of origin. - This does not apply to passengers younger than 21 years of age, who are children of nationals of an EU Member State, Iceland, Liechtenstein, Norway, Switzerland or the United Kingdom residing in Czechia. A birth certificate or its copy must be presented together with a copy of the residence permit of the parent issued by Czechia or document confirming residence (address) in Czechia such as lease contract or a copy of the Czech ID card of the parent. If the child is not a national of an EU Member State, Iceland, Liechtenstein, Norway, Switzerland, the United Kingdom or of an EU visa free country, a visa or a residence permit is required. - This does not apply to passengers who are spouses or registered partners of a national of an EU Member State, Iceland, Liechtenstein, Norway, Switzerland or the United Kingdom residing in Czechia. A marriage certificate (or proof of the conclusion of a registered partnership) or its copy must be presented together with a copy of the residence permit issued by Czechia or a document confirming residence (address) in Czechia such as lease contract or a copy of a Czech ID card of the spouse. If the spouse is not a national of an EU Member State, Iceland, Liechtenstein, Norway, Switzerland, the United Kingdom or of an EU visa free country, a visa or a residence permit is required. - This does not apply to passengers who are parents caring for their children who are nationals of Czechia or who are nationals of an EU Member State, Iceland, Liechtenstein, Norway, Switzerland or United Kingdom. They must have: - a birth certificate or its copy together with a copy of the residence permit or of the Czech ID card issued by Czechia to the child or a document confirming residence (address) in Czechia such as lease contract;- if the child is 21 years or older, a document confirming dependency and need of care, e.g., medical confirmation;- if the parent is not a national of an EU Member State, Iceland, Liechtenstein, Norway, Switzerland, the United Kingdom or of an EU visa free country, a visa or a residence permit is required. - This does not apply to passengers who are parents dependent on their children who are Czech nationals or for nationals of another EU Member State, Iceland, Liechtenstein, Norway, Switzerland or United Kingdom residing in Czechia. A birth certificate or its copy must be presented together with a copy of a residence permit issued by Czechia or document confirming residence (address) in Czechia such as lease contract or a copy of a Czech ID card of their child. In case the parent is not a national of EU Member State, Iceland, Liechtenstein, Norway, Switzerland or United Kingdom or a national of EU visa free country, visa or residence permit must be presented. Furthermore, document confirming dependency and need of care must be presented (such as medical confirmation). - This does not apply to passengers who are children dependent on their parents who are Czech nationals or for nationals of another EU Member State, Iceland, Liechtenstein, Norway, Switzerland or United Kingdom residing in Czechia. A birth certificate or its copy must be presented together with a copy of a residence permit issued by Czechia or document confirming residence (address) in Czechia such as lease contract or a copy of a Czech ID card of their parent. In case the child is not a national of EU Member State, Iceland, Liechtenstein, Norway, Switzerland or United Kingdom or a national of EU visa free country, visa or residence permit must be presented. Furthermore, document confirming dependency and need of care must be presented (such as medical confirmation). - This does not apply to nationals of EU Member States, Iceland, Liechtenstein, Norway, Switzerland or the United Kingdom residing in Czechia with a document confirming residence in Czechia, e.g., a lease contract and one of the following documents:- European Health Insurance Card issued by Czechia;- employment contract with the place of work in Czechia;- confirmation of study in Czechia. - This does not apply to passengers with a short-stay visa (C) issued by Czechia, whose national comment section of the visa sticker includes line SEZONNI. Another two documents must be presented: a laboratory confirmation of negative result of PCR test on COVID 19 and a medical confirmation of this negative result. These two documents may be replaced by the letter of a Minister of the Government of the Czech Republic granting exception. - This does not apply to passengers with a short-stay visa (C) issued by Czechia after May 11, 2020, whose national comment section of the visa sticker includes line ZAMESTNANI and their spouse and minor children who are holders of visas and travel together with the holder of the short-stay visa (C). Another two documents must be presented for each person travelling: a laboratory confirmation of negative result of PCR test on COVID 19 and a medical confirmation of this negative result. These two documents may be replaced by the letter of a Minister of the Government of the Czech Republic granting exception.", "possible_bannees": ["AD", "IS", "LI", "MC", "NO", "SM", "CH"]}, "Germany": {"published_date": "18.05.2020", "ISO2": "DE", "info": "1.Passengers are not allowed to enter Germany.This does not apply to:- nationals of Germany;- passengers with a residence permit issued by Germany;- passengers with a D-Visa issued by Germany;- husband, wife, child and registered partner of nationals or residents of Germany;- passengers with evidence that their travel is to perform a professional activity, e.g., commuters, diplomats, nursing staff, food industry personnel, specialists;- passengers in transit to their home country, if there is no other travel option. The purpose of travel and the entry requirements for the destination and transit countries must be proved;- US military personnel stationed in Germany and their family members；- merchant seamen who are going to sign up on board or leave Germany for the purpose of repatriation.2. Passengers allowed to enter Germany must self-isolate and must proceed directly to their own home, or other suitable accommodation for a period of 14 days.- This does not apply to merchant seamen without Coronavirus (COVID-19) symptoms.", "possible_bannees": []}, "Djibouti": {"published_date": "24.03.2020", "ISO2": "DJ", "info": "Flights to Djibouti are suspended.", "possible_bannees": []}, "Denmark": {"published_date": "24.04.2020", "ISO2": "DK", "info": "1. Passengers are not allowed to enter Denmark.-This does not apply to:- nationals and residents of Denmark.- passengers traveling to visit a critically or terminal ill family member; to participate in a funeral or if already in an ongoing health treatment or when called for a court case; - legal guardian of a minor or traveling to exercise visitation rights to a minor. - passengers with documentation to prove employment in Denmark;- passengers with documentation to prove that parked at Copenhagen Airport (CPH) is the vehicle needed for their ongoing journey out of Denmark (e.g., to Sweden).", "possible_bannees": ["SE"]}, "Dominica": {"published_date": "16.04.2020", "ISO2": "DM", "info": "1.Passengers are not allowed to enter Dominica.-This does not apply to nationals of Dominica who will be placed in a 14-day mandatory quarantine. 2.Airline crew is not allowed to disembark.", "possible_bannees": []}, "Dominican Republic": {"published_date": "03.05.2020", "ISO2": "DO", "info": "Flights to Dominican Rep. are suspended.", "possible_bannees": ["DM"]}, "Algeria": {"published_date": "17.04.2020", "ISO2": "DZ", "info": "Flights to Algeria are suspended.", "possible_bannees": []}, "Ecuador": {"published_date": "22.04.2020", "ISO2": "EC", "info": "Flights to Ecuador are suspended.", "possible_bannees": []}, "Estonia": {"published_date": "15.05.2020", "ISO2": "EE", "info": "Passengers are not allowed to enter Estonia.-This does not apply to: - nationals and residents of Estonia;- parent, child or spouse of nationals or residents of Estonia;- nationals and residents of Latvia and Lithuania;- passengers who are entering Estonia in order to go back home. They must not show any symptoms of Coronavirus (COVID-19);- nationals and residents of Latvia who work in Estonia. They must not show any symptoms of Coronavirus (COVID-19);- passengers directly involved in transporting goods and raw materials, including the loading of goods;- persons related to the international transport of goods and passengers, members of the team or crew servicing the international means of transport, and the persons performing repair, warranty or - maintenance operations on the means of transport;- passengers related to the business continuity of critical services;- passengers whose arrival in Estonia is related to the maintenance, repair or warranty activities of a device, or operations related to information and communication technology, if these are necessary for ensuring the operation of a company;", "possible_bannees": ["LV", "LT"]}, "Egypt": {"published_date": "27.04.2020", "ISO2": "EG", "info": "Flights to Egypt are suspended.- This does not apply to:- aircraft in state of emergency;- the following flights with pre-authorization from the Egyptian Civil Aviation Authority: humanitarian flights, medevac, repatriation flights, technical landings and United Nations flights.", "possible_bannees": []}, "Eritrea": {"published_date": "02.04.2020", "ISO2": "ER", "info": "Asmara (ASM) is closed.", "possible_bannees": []}, "Spain": {"published_date": "18.05.2020", "ISO2": "ES", "info": "1. Passengers are not allowed to enter Spain. This does not apply to:- Nationals and residents of Spain;- Passengers returning via Spain to their place of residency in Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or Switzerland;- Passengers with a long-term visa issued by a Schengen Member State, returning via Spain to their country of residence;- Immediate family members of a national of Spain traveling together or traveling to join the national of Spain;- Healthcare or elderly care professionals in the performance of their duties;- Transport of goods personnel;- Diplomats, international organizations, military personnel and members of humanitarian organizations in the performance of their duties;- People traveling for imperative family reasons duly accredited;- Persons who document reasons of force majeure or situation of need, or whose entry is permitted for humanitarian reasons.2. Passengers are required to self-quarantine for 14 days.- This does not apply to transport of goods personnel.- This does not apply to healthcare professionals in the performance of their duties if they have not been in contact with Coronavirus (COVID-19) patients.3. A completed Public Health Passenger Locator Form must be presented upon arrival.4. Passengers can only land at Alicante (ALC), Barcelona (BCN), Fuerteventura (FUE), Gran Canaria (LPA), Ibiza (IBZ), Madrid (MAD), Malaga (ADP), Menorca(MAH), Lanzarote (ACE), Palma de Mallorca (PMI), Sevilla (SVQ), Tenerife-Sur (TFS) or Valencia (VLC).- This does not apply to emergency, humanitarian or medical flights and technical stops.", "possible_bannees": ["AD", "AT", "BE", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GR", "HU", "IS", "IE", "IT", "LV", "LI", "LT", "LU", "MT", "NO", "PL", "PT", "RO", "SK", "SI", "SE", "CH"]}, "Ethiopia": {"published_date": "22.03.2020", "ISO2": "ET", "info": "All passengers arriving in Ethiopia will be placed in a mandatory quarantine at the Ethiopian Skylight Hotel for 14 days at their own expense.", "possible_bannees": []}, "Finland": {"published_date": "14.05.2020", "ISO2": "FI", "info": "1. Passengers are not allowed to enter Finland.- This does not apply to:- nationals of Finland and their family members; - passengers with a residence permit issued by Finland; - nationals and family members of nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland residing in Finland or returning via Finland to their country of residence;- passengers with a British passport and their family members residing in Finland or returning via Finland to their country of residence;- residents of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom, returning via Finland to their country of residence;- passengers traveling for work or commission-related commuting, if arriving from another EU or Schengen Member State;- passengers studying in Finland, if arriving from another EU or Schengen Member State;- healthcare and rescue service professionals/personnel, health researchers, and elderly care professionals;- transport personnel and other transport staff to the extent necessary;- workers, who based on permanent employee relationship work daily in another country and returns back to the country of residence at least once a week, taking into consideration local circumstances and natural travel-to-work area;- diplomats, staff of international organizations, military personnel and personnel of aid organizations in duty;- necessary transit and returns;- passengers travelling for imperative family reasons;- persons in need of international protection or for other humanitarian reasons;- other necessary and justified traffic, e.g. imperative personal reasons, maintenance personnel of work which cannot be postponed.2. Passengers allowed to enter Finland are required to self-isolate for 14 days. Under self-isolation, the person is allowed to move between their workplace and place of residence and for other essential reasons. - This does not apply to emergency medical service, rescue service and Border Guard and Customs personnel.", "possible_bannees": ["AT", "BE", "BG", "HR", "CY", "CZ", "DK", "EE", "FR", "DE", "GR", "HU", "IS", "IE", "IT", "LV", "LI", "LT", "LU", "MT", "NO", "PL", "PT", "RO", "SK", "SI", "ES", "SE", "CH"]}, "Fiji": {"published_date": "30.03.2020", "ISO2": "FJ", "info": "1. Passengers and airline crew are not allowed to enter Fiji. - This does not apply to nationals of Fiji.2. Nationals of Fiji must go into quarantine for a period of 14 days.", "possible_bannees": []}, "Falkland Islands (Malvinas)": {"published_date": "11.05.2020", "ISO2": "FK", "info": "Passengers are not allowed to enter Falkland Isl. (Malvinas).- This does not apply to:- returning residents, passengers with Falkland Isl. (Malvinas) status, passengers with a residence or work permit;- passengers traveling on official business for the Falkland Isl. (Malvinas)'s Government;- passengers with a permission to travel issued by the Falkland Isl. (Malvinas)’s Government.", "possible_bannees": []}, "Micronesia, Federated States of": {"published_date": "31.03.2020", "ISO2": "FM", "info": "1. Passengers traveling to the state of Chuuk must self-quarantine for 14 days in a Coronavirus (COVID-19) free country before departure.2. Passengers and airline crew must go through medical screening upon arrival. 3. Passengers are not allowed to enter the state of Pohnpei.- This does not apply to residents of Pohnpei.- This does not apply to medical and technical personnel.4. Passengers traveling to the state of Pohnpei must have a medical certificate and must be quarantined for 14 days.5. Passengers traveling to the state of Chuuk will be quarantined for 14 days.", "possible_bannees": []}, "France": {"published_date": "06.05.2020", "ISO2": "FR", "info": "1. Passengers arriving from a non-Schengen Member State are not allowed to enter France.- This does not apply to:- nationals of France, their spouses and children;- nationals of an EEA Member State and Switzerland returning home, their spouses and children; - passengers with a residence permit issued by France, their spouses and children;- passengers with a residence permit issued by an EEA Member State, Switzerland or the United Kingdom returning home, their spouses and children;- healthcare professionals and researchers related to Coronavirus (COVID-19); - personnel of diplomatic and consular missions and international organizations headquartered or having an office in France; - cross-border workers.2. A completed International Travel Certificate must be presented prior to boarding and to Immigration upon arrival or when transiting France. The certificate must be obtained before departure via the French consular offices abroad or online at https://www.interieur.gouv.fr.", "possible_bannees": ["CH"]}, "Gabon": {"published_date": "16.03.2020", "ISO2": "GA", "info": "Passengers who have been in Austria, Belgium, Bulgaria, China (People’s Rep.), Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Italy, Ireland (Rep.), Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Spain, Slovakia, Slovenia, Sweden, Switzerland, USA or the United Kingdom in the last 14 days are not allowed to enter Gabon. - This does not apply to nationals and residents of Gabon.", "possible_bannees": ["AT", "BE", "BG", "CN", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GR", "HU", "IE", "IT", "LV", "LI", "LT", "LU", "MT", "NO", "PL", "PT", "RO", "SK", "SI", "ES", "SE", "CH"]}, "United Kingdom": {"published_date": "12.05.2020", "ISO2": "GB", "info": "No regulations related to Coronavirus (COVID-19) implemented.", "possible_bannees": []}, "Grenada": {"published_date": "17.04.2020", "ISO2": "GD", "info": "Maurice Bishop International Airport (GND) and Lauriston Airport (CRU) are closed for all passenger traffic.", "possible_bannees": []}, "Georgia": {"published_date": "18.03.2020", "ISO2": "GE", "info": "1. Passengers are not allowed to enter Georgia.- This does not apply to nationals and residents of Georgia.- This does not apply to representatives of diplomatic missions and international organizations and their family members accredited to Georgia.- This does not apply to mixed families where one of the spouses or their under age child is a citizen of Georgia.- This does not apply to passengers who are part of the humanitarian mission if trip of such mission (doctors, volunteers) becomes a necessity. - This does not apply to passengers who have been granted the status of stateless persons by respective authorities of Georgia.- This does not apply to passengers who are holding status neutral travel documents.- This does not apply to passengers with a refugee status in Georgia.2. Passengers with a residence permit issued by Georgia must get an OKTOBOARD before departing for Georgia. ", "possible_bannees": []}, "French Guiana": {"published_date": "06.05.2020", "ISO2": "GF", "info": "1. A completed International Travel Certificate must be presented prior to boarding and to Immigration upon arrival or when transiting French Guiana. The certificate must be obtained before departure via the French consular offices abroad or online at https://www.interieur.gouv.fr.2. Passengers must go through a medical examination upon arrival and are subject to quarantine for a period of 14 days.- This does not apply to healthcare professionals related to Coronavirus (COVID-19).", "possible_bannees": []}, "Ghana": {"published_date": "02.05.2020", "ISO2": "GH", "info": "1. Flights to Ghana are suspended.- This does not apply to emergency flights, humanitarian flights, technical landing for refuel and medical evacuation flights.2. Airline crew will undergo mandatory quarantine during their rotation/rest period.", "possible_bannees": []}, "Gibraltar": {"published_date": "16.04.2020", "ISO2": "GI", "info": "Passengers are not allowed to enter Gibraltar.- This does not apply to passengers with a British passport with nationality \"British Overseas Territories Citizen\" issued by Gibraltar.- This does not apply to passengers with a British passport born in Gibraltar.- This does not apply to British nationals with a national ID card issued by Gibraltar.- This does not apply to residents of Gibraltar.- This does not apply to merchant seamen with an Immigration pre-clearance letter issued by the Borders and Coastguards Agency.- This does not apply to nationals of Spain on their way to Spain.- This does not apply to residents of Spain on their way to Spain.- This does not apply to passengers who are taking up employment or carrying out a work activity in Gibraltar.- This does not apply to military personnel with a travel order issued by NATO or the United Kingdom.- This does not apply to passengers with an authorization letter issued by the Borders and Coastguards Agency.", "possible_bannees": ["ES"]}, "Greenland": {"published_date": "24.04.2020", "ISO2": "GL", "info": "Please see Coronavirus (COVID-19) regulations for Denmark.", "possible_bannees": ["DK"]}, "Gambia": {"published_date": "22.04.2020", "ISO2": "GM", "info": "Flights to Gambia are suspended.", "possible_bannees": []}, "Guinea": {"published_date": "14.05.2020", "ISO2": "GN", "info": "Guinea's borders are closed.- This does not apply to nationals of Guinea with an approval from the government and a medical certificate stating that the passenger is not affected by Coronavirus (COVID-19).", "possible_bannees": []}, "Guadeloupe": {"published_date": "06.05.2020", "ISO2": "GP", "info": "1. Passengers are not allowed to enter the French West Indies. - This does not apply to:- passengers who reside in the French West Indies;- passengers traveling for urgent health reasons;- passengers traveling for imperative business reasons.2. A completed International Travel Certificate must be presented prior to boarding and to Immigration upon arrival or when transiting the French West Indies. The certificate must be obtained before departure via the French consular offices abroad or online at https://www.interieur.gouv.fr 3. Passengers must go through a medical examination upon arrival and are subject to quarantine for a period of 14 days.- This does not apply to healthcare professionals related to Coronavirus (COVID-19).", "possible_bannees": []}, "Equatorial Guinea": {"published_date": "24.04.2020", "ISO2": "GQ", "info": "Flights to Equatorial Guinea are suspended.- This does not apply to charter flights if they have a special permit obtained from the Civil Aviation.", "possible_bannees": ["GN"]}, "Greece": {"published_date": "15.05.2020", "ISO2": "GR", "info": "1. Passengers are not allowed to enter Greece.- This does not apply to:- nationals and family members of nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland;- passengers with a British passport and their family members;- nationals of North Macedonia returning via Thessaloniki (SKG) and continuing by road to North Macedonia. Their trip must be prearranged by the authorities, e.g., Ministry of Foreign affairs, embassy, etc.;- passengers with a residence permit issued by Greece. A certificate of application for renewal of a residence permit is not accepted;- passengers with a residence permit issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom;- passengers with a long term visa issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom;- healthcare professionals and health researchers designated to support the national health care system;- government members, diplomats, staff of international organizations, military personnel and humanitarian aid workers in the exercise of their duties;- passengers travelling for imperative family or business reasons with an authorization issued by the Greek embassy/consulate.2. Passengers arriving in Greece must be in quarantine for 14 days and must give their contact information to the authorities upon arrival.- This does not apply to state flights, sanitary flights, humanitarian flights and military flights.3. Flights from Albania, North Macedonia (Rep.) and Turkey are suspended.- This does not apply to:- flights approved by the Hellenic Ministry of Foreign Affairs for repatriation of Greek citizens, their family members and holders of residence permit in Greece.- state flights, sanitary flights, humanitarian flights, emergency flights, fire fighting flights, frontex flights and technical landings if passengers do not disembark.4. Flights from Italy, Netherlands, Spain and the United Kingdom are suspended.- This does not apply to:- flights designated to support the Hellenic national healthcare system.- flights approved by the Hellenic ministry of Foreign Affairs for repatriation of Greek citizens, their family members and holders of residence permit in Greece.- state flights, sanitary flights, humanitarian flights, emergency flights, military flights, fire fighting flights, frontex flights and technical landings if passengers do not disembark.", "possible_bannees": ["AL", "AT", "BE", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "HU", "IS", "IE", "IT", "LV", "LI", "LT", "LU", "MT", "NO", "PL", "PT", "RO", "SK", "SI", "ES", "SE", "CH", "TR"]}, "Guatemala": {"published_date": "07.05.2020", "ISO2": "GT", "info": "Airports in Guatemala are closed. - This does not apply to humanitarian, military or ambulance flights.", "possible_bannees": []}, "Guam": {"published_date": "30.03.2020", "ISO2": "GU", "info": "1. Passengers who have been in a country with confirmed Coronavirus (COVID-19) cases for more than one week and do not hold a document recognized and certified by DPHSS (Guam Department of Social Health and Services), which confirms they are not infected with Coronavirus (COVID-19), are not allowed to enter. The date of the test must be not more than 72 hours before the date of arrival. - This does not apply to residents of Guam. Passengers will be quarantined for a period of 14 days upon arrival. - This does not apply to passengers with a healthcare recognized and certified document which confirms that they are not infected with Coronavirus (COVID-19) within the last 72 hours.", "possible_bannees": []}, "Guinea-Bissau": {"published_date": "27.04.2020", "ISO2": "GW", "info": "Airports in Guinea-Bissau are closed.", "possible_bannees": ["GN"]}, "Guyana": {"published_date": "07.05.2020", "ISO2": "GY", "info": "Flights to Guyana are suspended.- This does not apply to:   - Nationals and residents of Guyana.   - Urgent health condition motive;   - Professional trips which cannot be deferred as authorized;   - Medevac flights;   - Technical stops for fuel only and special authorized flights.", "possible_bannees": []}, "Hong Kong": {"published_date": "19.05.2020", "ISO2": "HK", "info": "1. Passengers are not allowed to transit or enter Hong Kong SAR, China.- This does not apply to passengers with a Hong Kong SAR, China passport.- This does not apply to passengers with a British passport with nationality \"British National (Overseas)\" with the right of abode in Hong Kong SAR, China.- This does not apply to residents of Hong Kong SAR, China with a Permanent Identity Card.- This does not apply to residents of Hong Kong SAR, China with an Identity card accompanied by a valid work or study visa.- This does not apply to residents of Hong Kong SAR, China with an Identity card accompanied by a visa with \"Permission to remain extended until\". They must enter within the validity of the permitted stay.- This does not apply to passengers who have only been in the mainland of China, Chinese Taipei or Macao SAR, China in the past 14 days.- This does not apply to residents of Macao SAR, China who are registered the Macao SAR, China scheme that they will be immediately taken by coach back to Macao SAR, China upon entry.- This does not apply to the following passengers:a. Passengers travelling from the mainland of China or Chinese Taipei or Macao SAR, China and have not been to any other country/region in the past 14 days;b. Crew members of aircraft who need to commute to and from foreign places for performance of necessary duties or crew members of goods vessels;c. Government officials carrying out government duties including personnel of consular posts;d. Spouses and minor children of Hong Kong SAR, China residents;e. Personnel engaged in anti-epidemic work endorsed by the HKSAR Government.2. All passengers who are eligible to enter Hong Kong SAR, China will be required to undergo 14 days compulsory quarantine.3. All arriving passengers and crew members must present a completed Health Declaration Form to the Department of Health upon arrival. ", "possible_bannees": ["CN", "MO"]}, "Honduras": {"published_date": "22.04.2020", "ISO2": "HN", "info": "Airports in Honduras are closed.- This does not apply to humanitarian flights with an authorization issued 24h before departure by the Secretariat of tourism or Secretariat for foreign relations and international cooperation of Honduras.", "possible_bannees": []}, "Croatia": {"published_date": "07.05.2020", "ISO2": "HR", "info": "1. Passengers are not allowed to enter Croatia. - This does not apply to nationals of Croatia and their family members.- This does not apply to passengers with a long-term resident permit (temporary or permanent) issued by Croatia.- This does not apply to nationals of the EU, Schengen Member States and the Schengen Associated States or passengers from the United Kingdom and their family members on their way home.- This does not apply to passengers with a long-term resident permit or a long-term visa issued by the EU, Schengen Member States and the Schengen Associated States or the United Kingdom and the persons deriving their right to reside from other EU Directives or national law or who hold national long-term visas on their way home.- This does not apply to healthcare professionals, healthcare researchers and collaborators, experts in care for the elderly, and persons requiring urgent medical treatment. - This does not apply to cross-border workers.- This does not apply to diplomats, police officers in the performance of their activities, Civil Defence services and teams, international organizations staff and International military personnel in carrying out their functions.- This does not apply to passengers in transit (including passengers in transit by air).2. All passports and national ID cards issued to nationals of Croatia and which have expired on 11 March 2020 or later, are considered valid. This is due to the Coronavirus (COVID-19) pandemic.", "possible_bannees": []}, "Haiti": {"published_date": "14.04.2020", "ISO2": "HT", "info": "Flights to Port-au-Prince (PAP) and Cap-Haitien (CAP) are suspended. - This does not apply to emergency, humanitarian, medevac and government flights.", "possible_bannees": []}, "Hungary": {"published_date": "24.04.2020", "ISO2": "HU", "info": "1.Passengers are not allowed to enter Hungary-This does not apply to nationals of Hungary. -This does not apply to residents of Hungary who are nationals of an EEA Member State or Switzerland and who have a permanent residence card issued by Hungary.", "possible_bannees": ["CH"]}, "Indonesia": {"published_date": "12.05.2020", "ISO2": "ID", "info": "1. Passengers are not allowed to transit or enter Indonesia.- This does not apply to:- nationals of Indonesia;- passengers with a Temporary Stay Permit (ITAS) or Permanent Stay Permit (ITAP);- passengers with a Diplomatic Visa or a Service Visa;- passengers with a Diplomatic Stay Permit or Service Stay Permit;- medical aid workers or Food Sustenance Workers for Humanitarian Purposes;- personnel working on strategic national projects.2. Passengers allowed to enter Indonesia (except nationals of Indonesia) and airline crew must:- have a valid health certificate in English issued by Health Authority from respective country. It must be valid within 7 days and state that the passenger is free from respiratory disease and 'fit to travel'. It must also contain the PCR test result, and- have no travel history in the last 14 days from China (People's Rep.), France, Germany, Iran, Italy, Korea (Rep.), Spain, Switzerland, United Kingdom and Vatican City (Holy See), and- agree to self-quarantine for 14 days and fill in statement of compliance on arrival.3. Passengers arriving from countries with Coronavirus (COVID-19) confirmed cases must submit a health declaration form on arrival.4. Deadhead crew that will be active on return flight will be given an entry stamp if they:- have a valid crew ID card or crew member certificate; and- provide written notification from airline to Immigration Officer at entry point that the personnel will be on duty during return flight. This notification should be received by Immigration officer at entry point at latest 24 hours upon arrival.", "possible_bannees": ["CN", "FR", "DE", "IT", "ES", "CH"]}, "Ireland": {"published_date": "19.05.2020", "ISO2": "IE", "info": "Passengers arriving in Ireland (Rep.) are required to self-quarantine for 14 days and complete a Public Health Passenger Locator Form.- This does not apply when arriving from Northern Ireland. - This does not apply to essential supply chain workers, for example, a pilot or a haulier.", "possible_bannees": []}, "Israel": {"published_date": "06.04.2020", "ISO2": "IL", "info": "1. Passengers are not allowed to enter Israel.- This does not apply to:- nationals and residents of Israel.- passengers with an entry approval from the Population and Immigration Authority of Israel. 2.Transit facilities at Tel Aviv (TLV) are temporarily suspended.3. All international arrivals will be quarantined at a government-designated facility for a period of 14 days.", "possible_bannees": []}, "India": {"published_date": "04.05.2020", "ISO2": "IN", "info": "Flights to India are suspended.- This does not apply to flights that carry goods for trade or essential goods and supplies, and their crew members, helpers, cleaners.", "possible_bannees": []}, "Iraq": {"published_date": "24.04.2020", "ISO2": "IQ", "info": "Flights to Iraq are suspended.- This does not apply to red cross, humanitarian, Medevac, repatriation, emergency and military flights.", "possible_bannees": []}, "Iran, Islamic Republic of": {"published_date": "29.04.2020", "ISO2": "IR", "info": "1. Nationals of China (People's Rep.) with a normal passport, passengers with a Hong Kong (SAR China) passport and passengers with a Macao (SAR China) passport are no longer visa exempt. However, they can obtain a visa on arrival.2. Passengers must go through medical screening upon arrival and are subject to be tested for COVID-19 and to quarantine.3. A completed self-declaration form concerning Coronavirus (COVID-19) must be presented upon arrival.4. Based on the travel advisory restriction issued by United Arab Emirates Government, nationals of United Arab Emirates are not allowed to travel to Iran. ", "possible_bannees": ["CN", "HK", "MO"]}, "Iceland": {"published_date": "22.04.2020", "ISO2": "IS", "info": "1. Passengers are not allowed to enter Iceland. - This does not apply to:- nationals of EEA Member States and Switzerland;- passengers with a British passport; - passengers with a residence permit issued by a Schengen Member State;- family members of nationals of EEA Member States, Switzerland and of British nationals;- diplomats;- health and care workers traveling on duty;- humanitarian aid workers;- international organizations personnel;- passengers that require international protection; - passengers traveling on family emergencies;- members of armed forces traveling on duty. 2. Passengers traveling through Iceland on their way to another Schengen Member State must have a written confirmation of their permission to enter the other Schengen Member State.3. Passengers allowed to enter are subject to mandatory self-quarantine for 14 days upon arrival.", "possible_bannees": ["CH"]}, "Italy": {"published_date": "13.05.2020", "ISO2": "IT", "info": "1. Passengers are not allowed to enter Italy.- This does not apply to:- nationals or residents of Italy;- passengers traveling on business;- passengers traveling for urgent health reasons;- healthcare personnel traveling on duty;- passengers traveling for emergency reasons;- passengers returning via Italy to their country of residence. 2. Passengers allowed to enter Italy must present a completed self-declaration form to the transporting carrier; and- must communicate their entry to the Department of Prevention at local health units (ASL) of the entrance district; and- are subject to health surveillance and isolation for 14 days. This does not apply to passengers traveling on business if their stay in Italy does not exceed 72 hours and if granted, the additional 48 hours of a justified extension for specific needs.", "possible_bannees": []}, "Jamaica": {"published_date": "06.05.2020", "ISO2": "JM", "info": "1. Passengers are not allowed to enter Jamaica.- This does not apply to passengers with a Travel Authorization document issued by the government of Jamaica.2. Passengers with a Travel Authorization document issued by the government of Jamaica will be quarantined for 14 days. ", "possible_bannees": []}, "Jordan": {"published_date": "07.04.2020", "ISO2": "JO", "info": "Flights to Jordan are suspended.- This does not apply to:- emergency, humanitarian, medevac, repatriation, United Nations and state/diplomatic flights.- technical stops if crew and passengers do not disembark.", "possible_bannees": []}, "Japan": {"published_date": "16.05.2020", "ISO2": "JP", "info": "1. Passengers and airline crew who have transited through or have been in Albania, Andorra, Antigua and Barbuda, Armenia, Australia, Austria, Azerbaijan, Bahamas, Bahrain, Barbados, Belarus, Belgium, Bolivia, Bosnia and Herzegovina, Brazil, Brunei Darussalam, Bulgaria, Canada, Cape Verde, Chile, China (People's Rep.), Chinese Taipei, Congo (Dem. Rep.), Colombia, Cote d'Ivoire, Croatia, Cyprus, Czechia, Denmark, Djibouti, Dominica, Dominican Rep., Ecuador, Egypt, Equatorial Guinea, Estonia, Finland, France, Gabon, Germany, Greece, Guinea-Bissau, Honduras, Hong Kong (SAR China), Hungary, Iceland, Indonesia, Iran, Ireland (Rep.), Israel, Italy, Kazakhstan, Korea (Rep.), Kosovo (Rep.), Kuwait, Latvia, Liechtenstein, Lithuania, Luxembourg, Macao (SAR China), Malaysia, Maldives, Malta, Mauritius, Mexico, Moldova (Rep.), Monaco, Montenegro, Morocco, Netherlands, New Zealand, North Macedonia (Rep.), Norway, Oman, Panama, Peru, Philippines, Poland, Portugal, Qatar, Romania, Russian Fed., San Marino, Sao Tome and Principe, Saudi Arabia, Serbia, Singapore, Slovakia, Slovenia, Spain, St. Kitts and Nevis, Sweden, Switzerland, Thailand, Turkey, Uruguay, USA, Ukraine, United Arab Emirates, United Kingdom, Vatican City (Holy See) or Viet Nam in the past 14 days are not allowed to enter.- This does not apply to nationals of Japan.- This does not apply to spouses or children of nationals of Japan if they can prove it.- This does not apply to residents of Japan with “Permanent Resident\", \"Spouse or Child of Japanese National\", \"Spouse or Child of Permanent Resident\" or \"Long Term Resident\", who have departed Japan with Re-entry Permission by 2 April 2020.- This does not apply to residents of Japan with “Permanent Resident\", \"Spouse or Child of Japanese National\", \"Spouse or Child of Permanent Resident\" or \"Long Term Resident\", who have departed Japan with Re-entry Permission between 3 April and 28 April 2020 and have only been in Antigua and Barbuda, Azerbaijan, Bahamas, Barbados, Belarus, Cape Verde, Colombia, Djibouti, Dominican Rep., Equatorial Guinea, Gabon, Guinea Bissau, Honduras, Kazakhstan, Kuwait, Mexico, Maldives, Oman, Peru, Qatar, Russian Fed., Sao Tome and Principe, Saudi Arabia, St. Kitts and Nevis, United Arab Emirates, Ukraine or Uruguay. - This does not apply to residents of Japan with “Permanent Resident\", \"Spouse or Child of Japanese National\", \"Spouse or Child of Permanent Resident\" or \"Long Term Resident\", who have departed Japan with Re-entry Permission between 29 April and 15 May 2020 and have only been in Azerbaijan, Bahamas, Cape Verde, Colombia, Equatorial Guinea, Gabon, Guinea Bissau, Honduras, Kazakhstan, Mexico, Maldives, Sao Tome and Principe or Uruguay.- This does not apply to passengers with a Special Permanent Residence Permit. However, they must have a Re-entry Permit from a regional immigration officer.- This does not apply to US military personnel.- This does not apply to airline crew if they comply with the following requirements:(a) each crewmember must submit a quarantine questionnaire;(b) each crewmember must submit and a \"Plan of Stay in Japan\" declaration;(c) crews should adhere to the instructions provided in the quarantine document \"Notice: For Crews boarding vehicles from areas subject to strengthened quarantine\";(d) airlines should arrange chartered vehicles (as opposed to public transportation) to transport crews between the airport and their hotel; and (e) airlines should ensure that crews comply with items (a) through (d) above during their stay in Japan.2. Passengers and airline crew who have been in Albania, Andorra, Antigua and Barbuda, Armenia, Australia, Austria, Bahrain, Barbados, Belarus, Belgium, Bolivia, Bosnia and Herzegovina, Brazil, Brunei Darussalam, Bulgaria, Canada, Chile, China (People's Rep.), Chinese Taipei, Congo (Dem. Rep.), Cote d'Ivoire, Croatia, Cyprus, Czechia, Denmark, Djibouti, Dominica, Dominican Rep., Ecuador, Egypt, Estonia, Finland, France, Germany, Greece, Hong Kong (SAR China), Hungary, Iceland, Indonesia, Iran, Ireland (Rep.), Israel, Italy, Korea (Rep.), Kosovo (Rep.), Kuwait, Latvia, Liechtenstein, Lithuania, Luxembourg, Macao (SAR China), Malaysia, Malta, Mauritius, Moldova (Rep.), Monaco, Montenegro, Morocco, Netherlands, New Zealand, North Macedonia (Rep.), Norway, Oman, Panama, Peru, Philippines, Poland, Portugal, Qatar, Romania, Russian Fed., San Marino, Saudi Arabia, Serbia, Singapore, Slovakia, Slovenia, Spain, St. Kitts and Nevis, Sweden, Switzerland, Thailand, Turkey, USA, Ukraine, United Arab Emirates, United Kingdom, Vatican City (Holy See) or Viet Nam in the past 14 days must submit a quarantine questionnaire upon arrival.3. Visa exemption for passengers with passengers with a British passport, Hong Kong (SAR China) passport, Macao (SAR China) passport is suspended.4. Visa exemption for nationals of Andorra, Argentina, Austria, Bahamas, Barbados, Belgium, Brunei Darussalam, Bulgaria, Costa Rica, Croatia, Czechia, Cyprus, Denmark, Dominican Rep., El Salvador, Estonia, Finland, France, Germany, Greece, Guatemala, Honduras, Hungary, Iceland, Indonesia, Iran, Ireland (Rep.), Israel, Italy, Korea (Rep.), Latvia, Lesotho, Liechtenstein, Lithuania, Luxembourg, Malaysia, Malta, Mexico, Monaco, Netherlands, Norway, Peru, Poland, Portugal, Romania, San Marino, Singapore, Slovakia, Slovenia, Spain, Suriname, Sweden, Switzerland, Thailand, Tunisia, United Arab Emirates, Uruguay and Vatican City (Holy See) is suspended.5. Visa exemption for nationals of Azerbaijan, Bangladesh, Cambodia, Colombia, Georgia, India, Kazakhstan, Lao People's Dem. Rep., Mongolia, Myanmar, Nauru, Oman, Pakistan, Palau, Papua New Guinea, Paraguay, Qatar, Samoa, Solomon Isl., Turkmenistan, Ukraine, Uzbekistan and Viet Nam with a diplomatic, official or service passport is suspended.6. Passengers and airline crew who are eligible to enter Japan and have been in Albania, Armenia, Australia, Azerbaijan, Bahamas, Bahrain, Bolivia, Bosnia and Herzegovina, Brazil, Brunei Darussalam, Bulgaria, Canada, Cape Verde, Chile, China (People's Rep.), Chinese Taipei, Colombia, Congo (Dem. Rep.), Cote d'Ivoire, Croatia, Cyprus, Czechia, Dominica, Ecuador, Egypt, Equatorial Guinea, Finland, Gabon, Greece, Guinea-Bissau, Honduras, Hong Kong (SAR China), Hungary, Israel, Indonesia, Kazakhstan, Korea (Rep.), Kosovo (Rep.), Latvia, Lithuania, Macao (SAR China), Malaysia, Maldives, Mauritius, Mexico, Moldova (Rep.), Morocco, Montenegro, New Zealand, North Macedonia, Panama, Philippines, Poland, Romania, Sao Tome and Principe, Serbia, Singapore, Slovakia, Thailand, Turkey, USA, United Kingdom, Uruguay or Viet Nam in the past 14 days are required to undergo a PCR test upon arrival.- This does not apply to airline crew if they comply with the following requirements:(a) each crewmember must submit a quarantine questionnaire;(b) each crewmember must submit and a \"Plan of Stay in Japan\" declaration;(c) crews should adhere to the instructions provided in the quarantine document \"Notice: For Crews boarding vehicles from areas subject to strengthened quarantine\";(d) airlines should arrange chartered vehicles (as opposed to public transportation) to transport crews between the airport and their hotel; and (e) airlines should ensure that crews comply with items (a) through (d) above during their stay in Japan.7. Visa exemption granted to passengers with an APEC Business Travel Card issued by Brunei Darussalam, China (People's Rep.), Hong Kong (SAR China), Indonesia, Korea (Rep.), Malaysia, Mexico, Papua New Guinea, Peru, Philippines, Russian Fed., Singapore, Thailand or Viet Nam, is suspended.8. Nationals of China (People's Rep.) with a passport issued in Hubei Province or Zhejiang Province (China People's Rep.) are not allowed to enter Japan. - This does not apply when passengers can prove that they have not been in Hubei Province and Zhejiang Province the last 14 days. 9. Passengers who were in the cruise ship 'Westerdam' are not allowed to enter Japan. - This does not apply to nationals of Japan. 10. Visas issued on or before 8 March 2020 by the Embassies, Consulates-General and Consulate of Japan in China (People's Rep.), Hong Kong (SAR China), Korea (Rep.) or Macao (SAR China) are invalidated. 11. Visas issued on or before 20 March 2020 by the Embassies, Consulates-General and Consulate of Japan in Andorra, Austria, Belgium, Bulgaria, Croatia, Czechia, Cyprus, Denmark, Egypt, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom or Vatican City (Holy See) are invalidated. 12. Visas issued on or before 27 March 2020 by the Embassies, Consulates-General and Consulate of Japan in Bahrain, Brunei Darussalam, Congo (Dem. Rep.), Indonesia, Israel, Malaysia, Philippines, Qatar, Singapore, Thailand or Viet Nam are invalidated. 13. Visas issued on or before 2 April 2020 by the Embassies, Consulates-General and Consulate of Japan in Afghanistan, Algeria, Angola, Antigua and Barbuda, Argentina, Azerbaijan, Bahamas, Bangladesh, Barbados, Belarus, Belize, Benin, Bhutan, Botswana, Burkina Faso, Burundi, Cambodia, Cameroon, Cape Verde, Central African Rep., Chad, Colombia, Comoros, Congo, Cook Isl., Costa Rica, Cuba, Djibouti, Dominican Rep., El Salvador, Equatorial Guinea, Eritrea, Eswatini (Swaziland), Ethiopia, Fiji, Gabon, Gambia, Georgia, Ghana, Grenada, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, India, Iraq, Jamaica, Jordan, Kazakhstan, Kenya, Kiribati, Kyrgyzstan, Kuwait, Lao People's Dem. Rep., Lebanon, Lesotho, Liberia, Libya, Madagascar, Malawi, Maldives, Mali, Marshall Isl., Mauritania, Mexico, Micronesia (Federated States), Mongolia, Mozambique, Myanmar, Namibia, Nauru, Nepal, Nicaragua, Niger, Nigeria, Niue, Oman, Pakistan, Palau, Palestinian Territory, Papua New Guinea, Paraguay, Peru, Russian Fed., Rwanda, Samoa, Sao Tome and Principe, Saudi Arabia, Senegal, Seychelles , Sierra Leone, Solomon Isl., Somalia, South Africa, South Sudan, Sri Lanka, St. Kitts and Nevis, St. Lucia, St. Vincent and Grenadines, Sudan, Suriname, Syria, Tajikistan, Tanzania, Timor-Leste, Togo, Tonga, Trinidad and Tobago, Tunisia, Turkmenistan, Tuvalu, Uganda, Ukraine, United Arab Emirates, Uruguay, Uzbekistan, Vanuatu, Venezuela, Yemen, Zambia or Zimbabwe are invalidated.", "possible_bannees": ["AF", "AL", "DZ", "AD", "AO", "AG", "AR", "AM", "AU", "AT", "AZ", "BH", "BD", "BB", "BY", "BE", "BZ", "BJ", "BT", "BA", "BW", "BR", "BN", "BG", "BF", "BI", "KH", "CM", "CA", "TD", "CL", "CN", "CO", "CR", "HR", "CU", "CY", "CZ", "DK", "DJ", "DM", "EC", "EG", "SV", "GQ", "ER", "EE", "SZ", "ET", "FJ", "FI", "FR", "GA", "GE", "DE", "GH", "GR", "GD", "GT", "GN", "GW", "GY", "HT", "HN", "HK", "HU", "IS", "IN", "ID", "IQ", "IE", "IL", "IT", "JM", "JO", "KZ", "KE", "KI", "KW", "KG", "LV", "LB", "LS", "LR", "LY", "LI", "LT", "LU", "MO", "MG", "MW", "MY", "MV", "ML", "MT", "MR", "MU", "MX", "MC", "MN", "ME", "MA", "MZ", "MM", "NA", "NR", "NP", "NZ", "NI", "NG", "NU", "NO", "OM", "PK", "PW", "PA", "PG", "PY", "PE", "PL", "PT", "QA", "RO", "RW", "WS", "SM", "ST", "SA", "SN", "RS", "SC", "SL", "SG", "SK", "SI", "SO", "ZA", "SS", "ES", "LK", "SR", "SE", "CH", "TJ", "TH", "TL", "TG", "TO", "TT", "TN", "TR", "TM", "TV", "UG", "UA", "UY", "UZ", "VU", "VN", "YE", "ZM", "ZW"]}, "Kenya": {"published_date": "13.05.2020", "ISO2": "KE", "info": "1. Flights to Kenya are suspended.- This does not apply to:- aircraft in state of emergency;- operations related to humanitarian aid, evacuation, medevac, repatriation and diplomatic flights approved by appropriate authorities.2. Flights exempted from the suspension must express their intention in writing to KCAA before departure.3. Airline crew are required to self isolate at the designated airport hotels for the duration of their rest period.4. Approved flights must provide a completed passengers declaration forms and manifests to Port Health, Immigration and customs.", "possible_bannees": []}, "Kyrgyzstan": {"published_date": "20.03.2020", "ISO2": "KG", "info": "Flights to Kyrgyzstan are suspended.", "possible_bannees": []}, "Cambodia": {"published_date": "31.03.2020", "ISO2": "KH", "info": "1. All visa exemptions, visas on arrival and e-visas are suspended.2. All foreigners must:a. have a medical certificate, issued by competent health authorities of their country no more than 72 hours prior to the date of travel, certifying that they are not tested positive for the Coronavirus (COVID-19); andb. have proof of insurance policy with minimum medical coverage of fifty thousand US dollars.- This does not apply to passengers with diplomatic visa (Visa A) or official visa (Visa B) issued by Cambodia.3. Passengers upon arrival will be subject to a health risk assessment and screened by the government. They will also be subject to a mandatory isolation/quarantine.4. Passengers arriving from France, Germany, Iran, Italy, Spain or USA are not allowed to enter Cambodia. - This does not apply to nationals and residents of Cambodia. 5. Nationals and residents of Cambodia, diplomats and officials of foreign embassies and international organizations and their family members who have a Diplomatic Visa Type A and Official Visa Type B who live or have been in France, Germany, Iran, Italy, Spain or USA in the past 14 days will be quarantine for 14 days. - This does not apply to airline crew.", "possible_bannees": ["FR", "DE", "IT", "ES"]}, "Kiribati": {"published_date": "23.03.2020", "ISO2": "KI", "info": "Tarawa (TRW) is closed.", "possible_bannees": []}, "Comoros": {"published_date": "23.03.2020", "ISO2": "KM", "info": "Flights to Comoros are suspended.", "possible_bannees": []}, "Saint Kitts and Nevis": {"published_date": "12.04.2020", "ISO2": "KN", "info": "Airports in St. Kitts and Nevis are closed.", "possible_bannees": []}, "Korea, Democratic People's Republic of": {"published_date": "06.02.2020", "ISO2": "KP", "info": "1. Passengers traveling as tourists are not allowed to enter. 2. Passengers traveling on business or duty must spend 14 days in quarantine upon arrival.", "possible_bannees": []}, "Korea, Republic of": {"published_date": "16.04.2020", "ISO2": "KR", "info": "1. Short-term visas (type C-1 and C-3) issued on or before 5 April are invalidated.2. Visa exemptions for 90 nationalities with normal passport are temporarily suspended.- This does not apply to airline crew.- This does not apply to passengers with an APEC Business Travel Card. 3. Korean visas issued by the Wuhan Consulate in the Hubei Province are invalidated.4. Visitors who have been in the Hubei Province (China People's Rep.) in the past 14 days are not allowed to transit or enter Korea (Rep.). 5. Nationals of China (People’s Rep.) with a passport issued in the Hubei Province are not allowed to transit or enter Korea (Rep.).6. Passengers arriving from China (People's Rep) must have a visa issued by Korea (Rep.) to transit through Korea (Rep.). - This not apply to nationals of Albania, Andorra, Barbados, Dominica, Guyana, Ireland (Rep.), Korea (Rep.), Malta, Mexico, Monaco, Nicaragua, Palau, San Marino, Slovenia, St. Kitts and Nevis, St. Vincent and the Grenadines, USA, Vatican City (Holy See) and Venezuela. - This not apply to passengers with a British passport.- This does not apply to passengers with a diplomatic, consular, official, service or special passport. 7. Passengers are subject to mandatory self-quarantine for 14 days. 8. Nationals and residents of Korea (Rep.) are required to install 'Self-quarantine safety protection mobile app'. 9. Passengers and airline crew must install 'Self-diagnosis Mobile App' in their personal device and a completed Health Declaration Form and a Special Quarantine Declaration Form must be presented to the quarantine desk upon arrival.10. All flights must arrive at Incheon International Airport (ICN) between 5:00 and 20:00.", "possible_bannees": ["AL", "AD", "BB", "CN", "DM", "GY", "IE", "MT", "MX", "MC", "NI", "PW", "SM", "SI"]}, "Kuwait": {"published_date": "08.05.2020", "ISO2": "KW", "info": "1. Passengers are not allowed to enter Kuwait.- This does not apply to nationals of Kuwait and their first degree relatives. They must have a OK TO TRAVEL authorization obtained from the state of Kuwait embassy.- This does not apply to domestic workers if accompanied by a national of Kuwait. They must have a OK TO TRAVEL authorization obtained from the state of Kuwait embassy.- This does not apply to diplomatic passport holders, UN passport holders, members of UNESCO with prior approval from the government authorities.2. Passengers must install 'Shlonik' in their personal device before departure. Airlines must inform Kuwait DGCA of passengers who are not able to install it. Such passengers must present their boarding pass upon arrival.", "possible_bannees": []}, "Cayman Islands": {"published_date": "14.05.2020", "ISO2": "KY", "info": "Flights to Grand Cayman (GCM) are suspended.- This does not apply to emergency, repatriation and Medevac flights. They must obtain a prior approval from the Civil Aviation in Cayman Isl.", "possible_bannees": []}, "Kazakhstan": {"published_date": "06.05.2020", "ISO2": "KZ", "info": "Airports are closed for international flights.- This does not apply to state, ferry, sanitary flights and technical landings for refuel.", "possible_bannees": []}, "Lao People's Democratic Republic": {"published_date": "17.04.2020", "ISO2": "LA", "info": "Flights to Lao People's Dem. Rep. are suspended.", "possible_bannees": []}, "Lebanon": {"published_date": "12.04.2020", "ISO2": "LB", "info": "Flights to Lebanon are suspended.- This does not apply to:- diplomatic delegations working in Lebanon;- international organizations personnel;- military;- search and rescue, state aircraft and emergency medical flights; - United Nations Interim Force in Lebanon (UNIFIL) personnel associated with drilling operations in Block No. 4.", "possible_bannees": []}, "Saint Lucia": {"published_date": "15.04.2020", "ISO2": "LC", "info": "Airports in St. Lucia are closed.", "possible_bannees": []}, "Liechtenstein": {"published_date": "14.04.2020", "ISO2": "LI", "info": "1. Passengers are not allowed to enter Switzerland.- This does not apply to nationals or residents of Switzerland or Liechtenstein.- This does not apply to passenger with a cross-border commuter permit who are entering Switzerland for work, with a C-visa issued by Switzerland for the purpose of \"business meetings\" as specialists in the field of health or \"official visit\" of great importance, with a D-visa issued by Switzerland or who have an assurance of a residence permit.-This does not apply to passengers traveling directly through Switzerland to another country that they are permitted to enter.- This does not apply to passengers who are entitled to freedom of movement and have a professional reason for entering Switzerland and have a confirmation of registration.- This does not apply to passengers who are of great importance as specialists in the health sector.- This does not apply to passengers travelling by land to their country of origin or residency within the European Union or Schengen area. They must have a proof of onward journey.2. Passengers can only land at Basel (BSL), Geneva (GVA) or Zurich (ZRH).", "possible_bannees": ["CH"]}, "Sri Lanka": {"published_date": "22.04.2020", "ISO2": "LK", "info": "1. Airports in Sri Lanka are closed.- This does not apply to:a. Aircraft departures with passengers originating from Colombo, stop overs, transit passengers or visiting tourists.b. Emergency Diversions to Bandaranaike International Airport (CMB).c. Freighter Operations and humanitarian flights to CMB.d. Technical landings at CMB.2. A completed Health Declaration Form must be presented to the public health inspectors or any other authorized officials upon arrival. 3. Airline crew must self-quarantine at the location mentioned in the Health Declaration Form and have meals only through in-room dining until they operate the next flight. They must follow strict procedures and hygienic measures adopted by the Government of Sri Lanka.4. Visas and ETAs issued by Sri Lanka have been invalidated.5. The maximum allowed transit time at CMB is 12 hours. Passengers must have a confirmed onward connection.", "possible_bannees": []}, "Liberia": {"published_date": "24.04.2020", "ISO2": "LR", "info": "Flights to Liberia are suspended.- This does not apply to aircraft in state of emergency, technical landing.- This does not apply to humanitarian, medevac, Red Cross, repatriation, charter and special flights.", "possible_bannees": []}, "Lesotho": {"published_date": "29.04.2020", "ISO2": "LS", "info": "Passengers will be tested for Coronavirus (COVID-19) and placed in quarantine for 14 days.", "possible_bannees": []}, "Lithuania": {"published_date": "15.05.2020", "ISO2": "LT", "info": "1. Passengers are not allowed to enter Lithuania.-This does not apply to:- nationals and residents of Lithuania;- nationals of Poland with purpose of work, business or studies;- nationals of Estonia and Latvia;- family members of nationals of Lithuania;- diplomats accredited to Lithuania; - healthcare professionals traveling for the provision of transplant services;- passengers with permission by issued by the respective minister and by the government;- NATO personnel and personnel working for them and their family members.2.Passengers allowed to enter must arrive at Vilnius (VNO), Kaunas (KUN), Palanga (PLQ) or Siauliai (SQQ)3.Transit through Lithuania is possible only for passengers traveling in groups on their way back to their country of residence. They must be escorted to the international border crossing points.4.Flights with a permission issued by the Lithuanian Transport Safety Administration under the order of the Minister of Transport and Communications can operate to Lithuania.5.Returning nationals and residents of Lithuania are subject to 14 days isolation.- This does not apply to nationals of Lithuania when returning or arriving from Poland where they went for the purpose of work, business or studies. 6.Airline crew must be in isolation until their departure, but no longer than 14 days.", "possible_bannees": ["EE", "LV", "PL"]}, "Luxembourg": {"published_date": "21.03.2020", "ISO2": "LU", "info": "Passengers are not allowed to enter Luxembourg.- This does not apply to nationals of Luxembourg and their family members in order to return home.- This does not apply to nationals of the European Union, Schengen Member States and the Schengen Associated States, passengers from the United Kingdom, and their family members in order to return home. - This does not apply to passengers who have a long-term resident status in accordance with the European Directive 2003/109/EC relating to long-term residents, as well as any other person who have a right of residence in accordance with European directives as well as national law in Grand Duchy of Luxembourg or one of the neighboring countries.- This does not apply to healthcare professionals, health researchers and healthcare professionals to the elderly.- This does not apply to cross-border workers.- This does not apply to members of the diplomatic corps, personnel of international organizations, the military, personnel of the development cooperation and humanitarian aid, during the exercise of their respective functions.- This does not apply to passenger travelling by land to their country of origin. They must have a proof of onward journey.- This does not apply to passengers traveling for urgent and duly justified family reasons.- This does not apply to passengers who want to apply for international protection or subsidiary protection in the Grand Duchy of Luxembourg or for other humanitarian reasons.", "possible_bannees": []}, "Latvia": {"published_date": "19.05.2020", "ISO2": "LV", "info": "1. Passengers are not allowed to enter and transit Latvia. - This does not apply to nationals and residents of Estonia, Latvia and Lithuania. 2. Passengers who have been in other countries than Estonia and Lithuania in the past 14 days must self-isolate at their place of residence for a period of 14 days.", "possible_bannees": ["EE", "LT"]}, "Morocco": {"published_date": "30.03.2020", "ISO2": "MA", "info": "Flights to Morocco are suspended.", "possible_bannees": []}, "Monaco": {"published_date": "06.05.2020", "ISO2": "MC", "info": "1. Passengers arriving from a non-Schengen Member State are not allowed to enter France.- This does not apply to:- nationals of France, their spouses and children;- nationals of an EEA Member State and Switzerland returning home, their spouses and children; - passengers with a residence permit issued by France, their spouses and children;- passengers with a residence permit issued by an EEA Member State, Switzerland or the United Kingdom returning home, their spouses and children;- healthcare professionals and researchers related to Coronavirus (COVID-19); - personnel of diplomatic and consular missions and international organizations headquartered or having an office in France; - cross-border workers.2. A completed International Travel Certificate must be presented prior to boarding and to Immigration upon arrival or when transiting France. The certificate must be obtained before departure via the French consular offices abroad or online at https://www.interieur.gouv.fr.", "possible_bannees": ["FR", "CH"]}, "Moldova, Republic of": {"published_date": "16.03.2020", "ISO2": "MD", "info": "Passengers are not allowed to enter Moldova (Rep.). - This does not apply to nationals and residents of Moldova (Rep.).", "possible_bannees": []}, "Montenegro": {"published_date": "15.03.2020", "ISO2": "ME", "info": "1. Passengers are not allowed to enter Montenegro. - This does not apply to nationals of Montenegro. - This does not apply to passengers who reside in Montenegro. 2. Nationals and residents of Montenegro will be required to self-isolate for 14 days.", "possible_bannees": []}, "Madagascar": {"published_date": "20.04.2020", "ISO2": "MG", "info": "All flights to Madagascar are suspended.", "possible_bannees": []}, "Marshall Islands": {"published_date": "03.04.2020", "ISO2": "MH", "info": "Passengers are not allowed to enter Marshall Isl.", "possible_bannees": []}, "North Macedonia": {"published_date": "22.03.2020", "ISO2": "MK", "info": "North Macedonia (Rep.) borders are closed.- This does not apply to nationals and residents of North Macedonia (Rep.).- This does not apply to accredited diplomats.- This does not apply to passengers with a special permit issued by the Ministry of Interior of North Macedonia (Rep.).", "possible_bannees": []}, "Mali": {"published_date": "04.05.2020", "ISO2": "ML", "info": "Flights to Mali are suspended.- This does not apply to humanitarian flights. ", "possible_bannees": []}, "Myanmar": {"published_date": "12.04.2020", "ISO2": "MM", "info": "1. Visa issuance is suspended.2. Flights to Myanmar are suspended.- This does not apply to relief flights.- This does not apply to medical evacuation flights.- This does not apply to special flights approved by the Department of Civil Aviation.3. Airline crew are subject to quarantine.", "possible_bannees": []}, "Mongolia": {"published_date": "06.05.2020", "ISO2": "MN", "info": "1. Passengers are not allowed to enter Mongolia.- This does not apply to nationals of Mongolia. - This does not apply to residents of Mongolia who are direct family members of a national of Mongolia.- This does not apply to accredited staff and their direct family members of diplomatic missions and offices of international organizations in Mongolia. - This does not apply to international freight transport drivers and railway train personnel of Mongolia, Russian Fed. and China (People’s Rep.). 2. Nationals of Mongolia will be placed in quarantine for 21 days at designated facilities upon arrival. After the quarantine period ends, they shall be under self-isolation at home for 14 days. 3. Residents of Mongolia who are direct family members of a national of Mongolia will be placed in quarantine for 21 days at designated facilities upon arrival. After the quarantine period ends, they shall be under self-isolation at home for 14 days. 4. Accredited staff and their direct family members of diplomatic missions and offices of international organizations in Mongolia will be quarantined for 21 days at designated facilities upon arrival. After the quarantine period ends, they shall be under self-isolation at home for 14 days. ", "possible_bannees": ["CN"]}, "Macao": {"published_date": "29.04.2020", "ISO2": "MO", "info": "1. Passengers are not allowed to enter Macao SAR, China.- This does not apply to residents of Macao SAR, China.- This does not apply to residents of the Mainland of China if they have not visited a foreign country 14 days prior to arrival.- This does not apply to residents of Chinese Taipei or Hong Kong SAR, China if they have not visited a foreign country 14 days prior to arrival.2. Passengers who reside or have been in the Hubei Province, China in the past 14 days are not allowed to enter Macao SAR, China unless they prove with a valid certificate that they are not infected with the Coronavirus (COVID-19).3. All passengers must obtain a Coronavirus (COVID-19) nucleic acid test report issued by a local medical institution within 7 days confirming that they have been tested negative for Coronavirus (COVID-19) before they can board their flight.4. Macao SAR, China registered non-resident workers (holders of the Non-resident Worker's Identification Card) are banned from entering Macao SAR, China except holders of non-resident worker’s identification card who have resident status in the Mainland of China, Hong Kong SAR, China and Chinese Taipei. They will have to undergo medical observation at the designated place for 14 days if they have been to Chinese Taipei or Hong Kong SAR, China in the past 14 days.5. Residents of Macao SAR, China must:- undergo medical observation at the designated place for 14 days if they have been to foreign country, Hong Kong SAR, China and Chinese Taipei in the past 14 days;- go through a six-to-eight hour medical examination if they have made multiple unusual entries into the Mainland of China on one day;- present a medical certificate of no infection with Coronavirus (COVID-19) upon entry into Macao SAR, China if they have been to Hubei Province, China in the past 14 days.6. Residents from Chinese Taipei or Hong Kong SAR, China who have not visited a foreign country 14 days prior to arrival will need to go to designated places for a 14-day medical observation.7. Residents from the Mainland of China who have not visited a foreign country, Hong Kong SAR , China or Chinese Taipei 14 days prior to arrival will need to go through a six to eight hour medical examination if they come from Guangdong, Henan, Hunan, Anhui, Jiangsu, Shandong, Sichuan, Heilongjiang, Zhejiang, Chongqing, Beijing or Shanghai. If they have visited Hong Kong SAR, China or Chinese Taipei 14 days prior to arrival, they will need to go to designated places for a 14-day medical observation.", "possible_bannees": ["CN", "HK"]}, "Northern Mariana Islands": {"published_date": "21.04.2020", "ISO2": "MP", "info": "1. Passengers arriving at Saipan from a country with identified Coronavirus (COVID-19) outbreak, including Guam, Hawaii and continental USA, are subject to 14 day quarantine at a hotel property.2. Passengers with the islands of Tinian or Rota as final destination, are subject to 14 day quarantine in Saipan before continuing to their final destination. 3. Passengers must complete a health form prior to landing in Saipan.", "possible_bannees": ["GU"]}, "Mauritania": {"published_date": "26.03.2020", "ISO2": "MR", "info": "All airports in Mauritania are closed.", "possible_bannees": []}, "Montserrat": {"published_date": "27.03.2020", "ISO2": "MS", "info": "Passengers are not allowed to enter Montserrat.- This does not apply to passengers from Montserrat.- This does not apply to passengers who have a permit of permanent residence.- This does not apply to husband, wife, child or other dependents of a person who is from or resides in Montserrat.", "possible_bannees": []}, "Malta": {"published_date": "14.04.2020", "ISO2": "MT", "info": "Flights to Malta are suspended.- This does not apply to ferry flights, humanitarian flights and repatriation flights.", "possible_bannees": []}, "Mauritius": {"published_date": "07.05.2020", "ISO2": "MU", "info": "1. Passengers are not allowed to transit or enter Mauritius.- This does not apply to nationals or residents of Mauritius, their spouses and children. They will be placed in quarantine.2. Airline crew must stay in their hotel rooms.", "possible_bannees": []}, "Maldives": {"published_date": "15.04.2020", "ISO2": "MV", "info": "1. Velana Airport (MLE) is closed from 16:00 to 01:00.2. All visas on arrival are suspended.- This does not apply to passengers with a special permission granted by the Maldives government. 3. Passengers traveling as tourists and airline crew who have been in Bangladesh, China (People's Rep.), Iran, Italy, Malaysia, Spain, Sri Lanka, United Kingdom or in North Gyeongsang and South Gyeongsang Provinces in Korea (Rep.), Ile-de-France and Grand Est (regions of France) and Bavaria, North Rhine Westphalia and Baden-Wuerttemberg (regions of Germany) in the past 14 days are not allowed to enter the Maldives. - This does not apply to nationals of Maldives and their spouses. 4. Nationals and residents of Maldives will be subject to 14-day quarantine upon arrival. Carriers intending to carry nationals of Maldives on inbound flights shall seek prior approval from relevant authorities.5. All passengers traveling to the Maldives for a purpose other than tourism will be quarantined for 14 days at a place designated by the Government.6. A completed \"Health Declaration Card\" and an \"Immigration Arrival Card\" must be presented upon arrival.7. Airline crew are subject to thermal scanning at the airport.", "possible_bannees": ["BD", "CN", "FR", "DE", "IT", "MY", "ES", "LK"]}, "Malawi": {"published_date": "28.04.2020", "ISO2": "MW", "info": "1. Passengers are not allowed to enter Malawi.- This does not apply to nationals of Malawi.- This does not apply to passengers who reside in Malawi. 2. Nationals and residents of Malawi are required to self-isolate. They will be monitored by health personnel.", "possible_bannees": []}, "Mexico": {"published_date": "12.05.2020", "ISO2": "MX", "info": "No regulations related to Coronavirus (COVID-19) implemented.", "possible_bannees": []}, "Malaysia": {"published_date": "18.05.2020", "ISO2": "MY", "info": "1. Passengers are not allowed to enter Malaysia.- This does not apply to nationals of Malaysia.- This does not apply to permanent residents of Malaysia with a MyPR card.- This does not apply to passengers with a Malaysia My Second Home (MM2H). They must have a Coronavirus (COVID-19) negative testing result before leaving for Malaysia.- This does not apply to spouses or children of nationals of Malaysia. They must have a sticker label visa in the passport specifically indicating they are either spouses or children. - This does not apply to passengers with a diplomatic passport.- This does not apply to passengers with official passport on a diplomatic mission.2. Passengers who are allowed to enter will be quarantined for 14 days at the designated quarantine stations.For nationals of Malaysia, the government will bear the cost of MYR 150 per day.For all other passengers, they are required to bear all the costs. 3. Transfer from an international flight to a domestic flight is not allowed.- This does not apply to nationals of Malaysia traveling to Sabah or Sarawak.4. Airline crew are subject to health screening upon arrival.", "possible_bannees": []}, "Mozambique": {"published_date": "28.04.2020", "ISO2": "MZ", "info": "Passengers must be registered upon arrival and self-quarantined for 14 days.", "possible_bannees": []}, "Namibia": {"published_date": "21.04.2020", "ISO2": "NA", "info": "Namibia's borders are closed.", "possible_bannees": []}, "New Caledonia": {"published_date": "01.04.2020", "ISO2": "NC", "info": "Flights to New Caledonia are suspended.", "possible_bannees": []}, "Norfolk Island": {"published_date": "19.05.2020", "ISO2": "NF", "info": "1. Passengers are not allowed to enter Australia. - This does not apply to nationals of Australia. - This does not apply to the immediate family members of nationals of Australia. - This does not apply to permanent residents of Australia and their immediate family members. - This does not apply to nationals of New Zealand residing in Australia. - This does not apply to diplomats accredited to Australia and currently resident in Australia, and their immediate family members.- This does not apply to nationals of Fiji, Kiribati, Marshall Isl., Micronesia (Federated States), Nauru, New Zealand, Niue, Palau, Papua New Guinea, Samoa (American), Solomon Isl., Tonga, Tuvalu and Vanuatu when they are transiting through Australia with a confirmed onward ticket for a flight to depart Australia within 72 hours of the arriving flight.- This does not apply to passengers who reside in Cook Isl., French Polynesia or New Caledonia when they are transiting through Australia with a confirmed onward ticket for a flight to depart Australia within 72 hours of the arriving flight.2. Passengers and airline crew are required to self-isolate for a period of 14 days at their first arrival location in Australia. If their duration of stay is less than 14 days, they must self-isolate for the entire duration of stay.- This does not apply to airline crew with the appropriate personal protective equipment.3. Airline crew who are nationals or residents of Australia must self-isolate at their place of residence (or hotel) between flights, or for 14 days, whichever is shorter.Airline crew who are not nationals or residents of Australia must self-isolate in their hotel on arrival until their next flight.4. For repatriation charter flights, airlines are advised to contact the Australian Border Force (ABF) as early as possible in the planning process. Airlines should not confirm or schedule flights before discussing arrangements with the ABF repatriation team.", "possible_bannees": ["AU", "FJ", "PF", "GN", "KI", "NR", "NC", "NZ", "NU", "PW", "PG", "WS", "TO", "TV", "VU"]}, "Nigeria": {"published_date": "22.04.2020", "ISO2": "NG", "info": "Airports in Nigeria are closed.- This does not apply to emergency and essential flights.", "possible_bannees": []}, "Nicaragua": {"published_date": "01.05.2020", "ISO2": "NI", "info": "Airports in Nicaragua are closed.- This does not apply to humanitarian flights with a flight authorization requested 72 hours prior to flight. The passenger manifest must be submitted with the request. ", "possible_bannees": []}, "Netherlands": {"published_date": "12.05.2020", "ISO2": "NL", "info": "1. Passengers are not allowed to enter the Netherlands.-This does not apply to nationals of EEA Member States and Switzerland. -This does not apply to British Nationals.-This does not apply to passengers with a residence permit issued to long term residents of EEA Member States, Switzerland and the United Kingdom.-This does not apply to passengers with a long-stay visa, including persons with a temporary residence permit (Machtiging Voor Voorlopig Verblijf - MVV).-This does not apply to passengers in transit.-This does not apply to :- family members of nationals of Switzerland, EEA Member States and of British nationals;- healthcare personnel;- frontier workers;- transport of goods personnel;- diplomats; - personnel of international and humanitarian organizations, - military personnel; - passengers traveling for emergency family reasons;- passengers in need of international protection or for other humanitarian reasons.2. A completed 'Health Declaration Form' for passengers departing from high risk Coronavirus (COVID-19) countries must be presented prior to boarding any aircraft with destination the Netherlands.3. Passengers departing from high risk Coronavirus (COVID-19) countries are instructed to immediately self-quarantine for 14 days upon arrival.", "possible_bannees": ["CH"]}, "Norway": {"published_date": "19.05.2020", "ISO2": "NO", "info": "1. Passengers are not allowed to enter Norway. - This does not apply to nationals and residents of Norway. - This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and passengers with a British passport if they reside, work or have property in Norway. If they cannot prove their residency in Norway, they must be able to prove their nationality in one of the countries listed above.- This does not apply to family members of nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and passengers with a British passport, if they are already residing in Norway or are moving to Norway.- This does not apply to nationals of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, Vatican City (Holy See) and passengers with a British passport if they are transiting via Norway to return to their country of residence.- This does not apply to passengers with a visa issued by Norway after 15 March 2020.- This does not apply to visa exempt nationals who have been granted a residence permit, but have not yet received the residence card (a letter from UDI with the approval of the residence permit will document that the permit has been granted). This also goes for family members of EEA citizens who have been granted a residence card, but the card has not been issued yet. - This does not apply to passengers with a D-visa in their passport.- This does not apply to spouses/cohabitants and children of holders of Norwegian diplomatic passport. - This does not apply to passengers in transit. - This does not apply to passengers who have a particular responsibility to care for residents of Norway or who have strong welfare reasons. - This does not apply to the following passengers:passengers with a diplomatic or service passport when they are accredited to Norway;passengers with an ID card as diplomat or a Schengen residence card issued to diplomatic staff;transit workers to oil platforms and similar;NATO staff with travel order;passengers with a valid flight certificate on duty;seamen in transit to or from ships;professional transporters of goods;media staff on duty;cruise passengers on cruises that started before 16 March 0800 CET transiting Norway to return home;holders of seasonal work permits in farming with an approval letter from UDI;foreigners who are either part or witness in a court case are permitted to enter Norway for the court case. They will have a summons from the court with the date and their duty to appear. 2. The following passengers must undergo a 10-day home quarantine:- nationals and residents of Norway;- nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and passengers with a British passport if they are residing or working in Norway;- passengers who have a particular responsibility to care for residents of Norway or who have strong welfare reasons.3. Airline crew and passengers must fill out the public health information form and hand it over to the local airport authority upon arrival.4. Passengers are only allowed to travel to Svalbard after they have stayed in quarantined in other parts of Norway.", "possible_bannees": ["AD", "AT", "BE", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GR", "HU", "IS", "IE", "IT", "LV", "LI", "LT", "LU", "MT", "MC", "PL", "PT", "RO", "SM", "SK", "SI", "ES", "SE", "CH"]}, "Nepal": {"published_date": "06.05.2020", "ISO2": "NP", "info": "1. International flights to Nepal are suspended.- This does not apply to evacuation, rescue and emergency flights with a special permission from Civil Aviation Authority of Nepal.2. Airline crew are subject to thermal screening.", "possible_bannees": []}, "Nauru": {"published_date": "07.03.2020", "ISO2": "NR", "info": "1. Passengers and airline crew who have transited through or have been in China (People's Rep.), Hong Kong (SAR China), Iran, Italy, Korea (Rep.) or Macao (SAR China) in the past 21 days are not allowed to enter Nauru. 2. Passengers and airline crew must complete a Health Declaration Card and submit it to the Health Personnel when arriving in Nauru. They will undergo health screening before entering Nauru.", "possible_bannees": ["CN", "HK", "IT", "MO"]}, "Niue": {"published_date": "20.03.2020", "ISO2": "NU", "info": "Passengers who have been in Australia, Austria, Belgium, Bulgaria, China (People's Rep.), Chinese Taipei, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hong Kong (SAR China), Hungary, Iceland, Ireland (Rep.), Indonesia, Iran, Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Macao (SAR China), Netherlands, Norway, Poland, Portugal, Romania, Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, Thailand, USA or United Kingdom in the past 14 days are not allowed to enter Niue.- This does not apply to nationals and resident of Niue.", "possible_bannees": ["AU", "AT", "BE", "BG", "CN", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GR", "HK", "HU", "IS", "ID", "IE", "IT", "JP", "LV", "LI", "LT", "LU", "MO", "MT", "NO", "PL", "PT", "RO", "SG", "SK", "SI", "ES", "SE", "CH", "TH"]}, "New Zealand": {"published_date": "10.04.2020", "ISO2": "NZ", "info": "1. Passengers are not allowed to enter New Zealand.- This does not apply to nationals of New Zealand (including Cook Isl., Niue, Tokelau).- This does not apply to the immediate family members of nationals of New Zealand.- This does not apply to passengers with a permanent resident visa and their immediate family members.- This does not apply to accredited diplomats residing in New Zealand.- This does not apply to nationals of Australia ordinarily resident in New Zealand.2. Passengers are not allowed to transit New Zealand.- Passengers, subject to Government agreement, are allowed to transit New Zealand.- This does not apply to nationals and residents of Australia transiting through New Zealand with final destination Australia and their immediate family members.3. Passengers will be subject to mandatory isolation at a Government facility for 14 days on arrival. - This does not apply to passengers transiting through New Zealand.4. Airline crew must use appropriate personal protective equipment (PPE). They are not subject to mandatory isolation.", "possible_bannees": ["AU", "NU", "TK"]}, "Oman": {"published_date": "07.05.2020", "ISO2": "OM", "info": "Passengers are not allowed to enter Oman.- This does not apply to nationals of Oman.", "possible_bannees": []}, "Panama": {"published_date": "21.04.2020", "ISO2": "PA", "info": "Flights to Panama are suspended.- This does not apply to humanitarian flights.", "possible_bannees": []}, "Peru": {"published_date": "14.04.2020", "ISO2": "PE", "info": "1. Passengers are not allowed to enter Peru.2. Airline crew must self-isolate at hotel Costa del Sol at Jorge Chavez International Airport for the entire duration of stay.", "possible_bannees": []}, "French Polynesia": {"published_date": "06.05.2020", "ISO2": "PF", "info": "1. Passengers are not allowed to enter French Polynesia. - This does not apply to passengers who reside in French Polynesia.2. A completed International Travel Certificate must be presented prior to boarding and to Immigration upon arrival or when transiting French Polynesia. The certificate must be obtained before departure via the French consular offices abroad or online at https://www.interieur.gouv.fr.3. Passengers must go through a medical examination upon arrival and are subject to quarantine for a period of 14 days.- This does not apply to healthcare professionals related to Coronavirus (COVID-19).4. Airline crew for repatriation flights are subject to a medical control and will complete a declaration on honour stating they will have to respect the sanitary measures requirements of self-isolation for 14 days.- This does not apply if they are in transit and stay in the aircraft.- This does not apply if they are authorized to go back on their company flight in case there is layover for one day or one night.", "possible_bannees": []}, "Papua New Guinea": {"published_date": "18.03.2020", "ISO2": "PG", "info": "1. Passengers and airline crew who have been in China (People's Rep.), Iran, Italy, Japan or Korea (Rep.) in the past 14 days are not allowed to enter Papua New Guinea. They must have spent 14 consecutive days in a country that is free from Coronavirus (COVID-19).2. Airline crew who are not nationals of Papua New Guinea must first obtain State of Emergency (SOE) controller approval to enter.", "possible_bannees": ["CN", "GN", "IT", "JP"]}, "Philippines": {"published_date": "18.05.2020", "ISO2": "PH", "info": "1. Passengers are not allowed to enter Philippines. - This does not apply to nationals of Philippines. - This does not apply to spouses or children of nationals of the Philippines. - This does not apply to accredited diplomats or officials of international organizations. 2. Commercial flights to Philippines can only land on Tuesday, Wednesday, Friday, Saturday or Sunday with an approval from CAAP 48h before departure.3. Chartered flights to Philippines can only land on Monday or Thursday with a secured clearance from the Department of Foreign Affairs and CAAP.4. Passengers and airline crew will be tested for Coronavirus (COVID-19) and placed in quarantine while awaiting the results of the test. 5. A completed Case Investigation Form must be presented upon arrival. ", "possible_bannees": []}, "Pakistan": {"published_date": "13.05.2020", "ISO2": "PK", "info": "1. Flights to Pakistan are suspended.- This does not apply to diplomatic, special and flights of national carriers. They must have a special approval from the competent authority for transporting stranded passengers.2. A completed International Passenger Health Declaration Form must be presented upon arrival.3. Passengers and airline crew are subject to health screening (including swab testing, isolation or quarantine). ", "possible_bannees": []}, "Poland": {"published_date": "24.04.2020", "ISO2": "PL", "info": "Flights to Poland are suspended. - This does not apply to flights with status HOSP, HUM, HEAD and other flights performed to save people's lives or health, flights to protect public order, emergency flights, flights at the order of the Prime Minister, flights performed by foreign air carriers at the order of foreign states to bring back their nationals.- This does not apply to aircraft with up to 15 seats. ", "possible_bannees": []}, "Saint Pierre and Miquelon": {"published_date": "06.05.2020", "ISO2": "PM", "info": "1. Passengers arriving from a non-Schengen Member State are not allowed to enter France.- This does not apply to:- nationals of France, their spouses and children;- nationals of an EEA Member State and Switzerland returning home, their spouses and children; - passengers with a residence permit issued by France, their spouses and children;- passengers with a residence permit issued by an EEA Member State, Switzerland or the United Kingdom returning home, their spouses and children;- healthcare professionals and researchers related to Coronavirus (COVID-19); - personnel of diplomatic and consular missions and international organizations headquartered or having an office in France; - cross-border workers.2. A completed International Travel Certificate must be presented prior to boarding and to Immigration upon arrival or when transiting France. The certificate must be obtained before departure via the French consular offices abroad or online at https://www.interieur.gouv.fr.", "possible_bannees": ["FR", "CH"]}, "Puerto Rico": {"published_date": "06.04.2020", "ISO2": "PR", "info": "1. Passengers will be quarantined for 14 days.2. Passengers must present a completed Puerto Rico Department of Health form upon arrival.", "possible_bannees": []}, "Portugal": {"published_date": "12.05.2020", "ISO2": "PT", "info": "Flights to Portugal are suspended.-This does not apply to flights arriving from Angola, Austria, Belgium, Brazil (Sao Paulo (GRU) and Rio De Janeiro (RIO)), Bulgaria, Canada, Cape Verde, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Guinea-Bissau, Hungary, Iceland, Ireland (Rep.), Latvia, Lithuania, Luxembourg, Malta, Mozambique, Netherlands, Norway, Poland, Portugal, Romania, Sao Tome and Principe, Slovakia, Slovenia, South Africa, Sweden, Switzerland, USA, United Kingdom or Venezuela.- This does not apply to:- state flights;- emergency flights;- medevac flights;- humanitarian/repatriation flights;- United Nations flights;- technical stopovers where passengers do not disembark.", "possible_bannees": ["AO", "AT", "BE", "BR", "BG", "CA", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GR", "GN", "GW", "HU", "IS", "IE", "LV", "LT", "LU", "MT", "MZ", "NO", "PL", "RO", "ST", "SK", "SI", "ZA", "SE", "CH"]}, "Palau": {"published_date": "06.02.2020", "ISO2": "PW", "info": "Passengers and airline crew who have transited through or have been in China (People's Rep.), Hong Kong (SAR China) or Macao (SAR China) in the past 14 days are not allowed to enter Palau.", "possible_bannees": ["CN", "HK", "MO"]}, "Paraguay": {"published_date": "17.04.2020", "ISO2": "PY", "info": "Flights to Paraguay are suspended.- This does not apply to health services and repatriation flights.", "possible_bannees": []}, "Qatar": {"published_date": "19.04.2020", "ISO2": "QA", "info": "1. Passengers are not allowed to enter Qatar.- This does not apply to nationals of Qatar.- This does not apply to residents of Qatar with a Permanent Residence card.", "possible_bannees": []}, "Réunion": {"published_date": "06.05.2020", "ISO2": "RE", "info": "1. A completed International Travel Certificate must be presented prior to boarding and to Immigration upon arrival or when transiting Reunion. The certificate must be obtained before departure via the French consular offices abroad or online at https://www.interieur.gouv.fr.2. Passengers must go through a medical examination upon arrival and are subject to quarantine for a period of 14 days.- This does not apply to healthcare professionals related to Coronavirus (COVID-19).", "possible_bannees": []}, "Romania": {"published_date": "18.05.2020", "ISO2": "RO", "info": "1. Passengers are not allowed to enter Romania.- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland. - This does not apply to passengers with a British passport. - This does not apply to family members of nationals of Romania.- This does not apply to family members of a national of an EEA Member State, Switzerland or the United Kingdom, with a residence in Romania.- This does not apply to passengers with a long-stay visa or a residence permit issued by Romania.- This does not apply to the following passengers:a. persons moving for professional purposes, proven by a visa, residence permit or other equivalent document; b. diplomatic or consular personnel, staff of international organisations, military personnel or personnel who can provide humanitarian aid; c. passengers in transit, including those repatriated as a result of the granting of consular protection; d. passengers travelling for imperative reasons (medical or family);e. persons in need of international or other humanitarian protection. 2. Flights from Austria, Belgium, France, Germany, Iran, Italy, Netherlands, Spain, Switzerland, Turkey, USA and United Kingdom are suspended. 3. Passengers must be isolated at home for 14 days. ", "possible_bannees": ["AT", "BE", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GR", "HU", "IS", "IE", "IT", "LV", "LI", "LT", "LU", "MT", "NO", "PL", "PT", "SK", "SI", "ES", "SE", "CH", "TR"]}, "Serbia": {"published_date": "19.05.2020", "ISO2": "RS", "info": "1. Passengers are not allowed to enter and transit Serbia. - This does not apply to nationals and residents of Serbia. - This does not apply to passengers with a special permission issued by the Ministry of Health, the Ministry of Foreign Affairs, the Ministry of Interior or the Ministry of Construction, Transport and Infrastructure. - This does not apply to accredited members of diplomatic missions and international organizations, and their family members.- This does not apply to passengers traveling on humanitarian flights agreed by way of diplomatic channels. 2. Passengers who are allowed to enter Serbia must have a negative PCR test for Coronavirus (COVID-19) issued by a reference laboratory from the country they travel from. The test must be issued within 72 hours of travel. - This does not apply to nationals and residents of Serbia. - This does not apply to children younger than 12 years if they are accompanied by their parents, guardians or companions with a negative test for Coronavirus (COVID-19).", "possible_bannees": []}, "Russian Federation": {"published_date": "26.03.2020", "ISO2": "RU", "info": "Passengers are not allowed to enter the Russian Fed. - This does not apply to nationals of the Russian Fed.; - This does not apply to accredited or appointed employees of diplomatic missions, consular offices, international organizations located in Russian Fed. and their family members;- This does not apply to members of official delegations;- This does not apply to travelers with diplomatic, business or normal visas issued in connection with the death of a close relative, as well as visas issued by special decision of the Russian Ministry of Foreign Affairs;- This does not apply to passengers from visa-free countries coming in connection with the death of a close relative, having copies of death certificate, as well as a document confirming family relations;- This does not apply to passengers who are family members (spouses, parents, kids, adoptive parents, adopted), guardians and trustees of citizens of the Russian Fed., subject to the presentation of a copy of a document confirming the relationship status;- This does not apply to passengers permanently residing in the Russian Fed., as well as transiting through airports without entering the Russian Fed.", "possible_bannees": []}, "Rwanda": {"published_date": "22.04.2020", "ISO2": "RW", "info": "1. Flights to Kigali International Airport (KGL) are suspended.2. Nationals and residents of Rwanda will be subject to a mandatory 14-day quarantine at designated locations.", "possible_bannees": []}, "Saudi Arabia": {"published_date": "19.05.2020", "ISO2": "SA", "info": "Flights to Saudi Arabia are suspended.- This does not apply to technical stops, humanitarian, medevac and repatriation flights. These flights are subject to prior approval from GACA. ", "possible_bannees": []}, "Solomon Islands": {"published_date": "04.05.2020", "ISO2": "SB", "info": "1. Passengers and airline crew are not allowed to enter Solomon Isl. - This does not apply to nationals and residents of Solomon Isl. - This does not apply to passengers with prior written authorization issued by the Prime Minister. 2. Nationals and residents of Solomon Isl. who have been in countries with confirmed cases of Coronavirus (COVID-19) will be put in quarantine for a period of 14 days upon arrival.3. Passengers with prior written authorization issued by the Prime Minister who have been in countries with confirmed cases of Coronavirus (COVID-19) will be put in quarantine for a period of 14 days upon arrival.4. Passengers must present a completed Traveler’s Public Health Declaration Card and provide full details of their place of stay, travel itinerary and current personal contact details in Solomon Isl.5. Passengers and airline crew must provide details of their international travel history for the period of 14 days prior to arrival in Solomon Isl.", "possible_bannees": []}, "Seychelles": {"published_date": "06.05.2020", "ISO2": "SC", "info": "1. Seychelles (SEZ) is closed.- This does not apply to emergency diversions.- This does not apply to special mission flights that are approved (MEDEVAC).", "possible_bannees": []}, "Sudan": {"published_date": "20.04.2020", "ISO2": "SD", "info": "Airports in Sudan are closed. - This does not apply to technical stops, humanitarian aid, medical and relief flights. These flights are subject to prior approval from Sudan Civil Aviation Authority. ", "possible_bannees": []}, "Sweden": {"published_date": "18.05.2020", "ISO2": "SE", "info": "Passengers arriving from outside Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Switzerland and United Kingdom are not allowed to enter.- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland, and their family members, if the purpose of the journey is to return to his or her home.- This does not apply to passengers with a British passport and their family members, if the purpose of the journey is to return to his or her home.- This does not apply to passengers with a residence permit issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom, if the purpose of the journey is to return to his or her home.- This does not apply to passengers with a national visa issued by Sweden, if the purpose of the journey is to return to his or her home.- This does not apply to the following passengers:a. healthcare personnel;b. border workers;c. personnel transporting goods and other personnel in the transport sector to the necessary extent;d. persons covered by Chapter 2. Section 10 of the Aliens Act (2005: 716);e. persons working in international organizations, military personnel and relief workers;f. passengers in transit; g. persons with urgent family reasons;h. persons in need of international protection or for other humanitarian reasons.", "possible_bannees": ["AT", "BE", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GR", "HU", "IS", "IE", "IT", "LV", "LI", "LT", "LU", "MT", "NO", "PL", "PT", "RO", "SK", "SI", "ES", "CH"]}, "Singapore": {"published_date": "29.04.2020", "ISO2": "SG", "info": "1. Passengers traveling as short-term visitors are not allowed to transit or enter Singapore. - This does not apply to returning residents of Singapore (Singapore Citizens, Permanent Residents or passengers with a Long-Term Pass (including passengers with a Work Pass, Student's Pass, Dependent’s Pass, and Long-Term Visit Pass)). Upon entry into Singapore, they must serve a 14-day self-isolation at dedicated Stay-Home-Notice (SHN) facilities. - Passengers with a new or existing Work Pass will be allowed entry if they have an approval letter from the Ministry of Manpower (MOM) or the Immigration and Checkpoints Authority (ICA). - Passengers with a Long-Term Visit Pass (LTVP) or a Long-Term Visit Pass In-Principle Approval (LTVP IPA) issued by the Immigration and Checkpoints Authority (ICA), will be allowed entry if they have an Approval Letter for Entry (ALE) issued by the Immigration and Checkpoints Authority (ICA).- Passengers with a Student's Pass (STP) or a Student's Pass In-Principle Approval (STP IPA), will be allowed entry if they have an Approval Letter for Entry (ALE) issued by the Ministry of Education (MOE) or the Immigration and Checkpoints Authority (ICA).2. Short-term visitors will be allowed entry into Singapore if they have an Approval Letter for Entry (ALE) from the Immigration and Checkpoints Authority (ICA), Ministry of Trade and Industry (MTI), Ministry of Foreign Affairs (MFA) or the Ministry of Health (MOH). They could still be subjected to the prevailing health screening requirements upon entry. Possession of an Approval Letter for Entry (ALE) does not guarantee the issuance of a Visit Pass to enter Singapore.3. Passengers entering Singapore, including Singapore Citizens, Permanent Residents and passengers with a Long-Term Pass (LTP), must submit a health declaration. This can be done via the SG Arrival Card (SGAC) e-Service (https://eservices.ica.gov.sg/sgarrivalcard) or via the mobile application (to be downloaded from Apple AppStore or Google Play).4. Airlines must inform passengers to submit their health declaration via the SG Arrival Card (SGAC) e-Service before arriving in Singapore.5. The paper-based embarkation/disembarkation card is discontinued. All airlines must stop distributing these cards for flights planned to arrive in Singapore on or after 27 March 2020, 0900 hours.6. Airline crew of foreign airlines, who are Singapore Citizens, Permanent Residents or long-term pass holders entering Singapore, will be issued with a Stay-Home Notice (SHN). Such crew with travel history to Brunei Darussalam, Cambodia, France, India, Indonesia, Lao People's Dem. Rep., Malaysia, Myanmar, Philippines, Switzerland, Thailand, USA, United Kingdom or Viet Nam within the last 14 days must serve the SHN at Crowne Plaza Changi Airport. Those who do not have travel history to the listed countries within the last 14 days may serve the SHN at their residence in Singapore. The SHN must be served until their next departure flight out of Singapore or for 14 days, whichever is earlier.7. Airline crew of foreign airlines, who are not Singapore Citizens, Permanent Residents or long-term pass holders, will not be allowed to enter Singapore, or transit through Singapore. This does not apply to flights that require a layover due to flight time limitations or an aircraft-on-ground (AOG) situation in Singapore. In this case, airlines may layover their flight and cabin crew at Crowne Plaza Changi Airport. They will be issued with an SHN which shall be served until their next departure flight out of Singapore.8. For flights that require a layover due to flight time limitations or an aircraft-on-ground (AOG) situation in Singapore, airlines may layover their flight and cabin crew at Crowne Plaza Changi Airport. They will be issued with an SHN which shall be served until their next departure flight out of Singapore.", "possible_bannees": ["BN", "KH", "FR", "IN", "ID", "MY", "MM", "CH", "TH", "VN"]}, "Saint Helena, Ascension and Tristan da Cunha": {"published_date": "29.03.2020", "ISO2": "SH", "info": "1. Passengers are not allowed to enter St. Helena.- This does not apply to passengers who reside in St. Helena.- This does not apply to passengers with a long-term permit.- This does not apply to temporary contractors.- This does not apply to sponsored Technical Cooperation Officers.- This does not apply to passengers traveling to Ascension.- This does not apply to persons authorized in advance by the Governor.2. All new arrivals will be subject to compulsory isolation for 14 days when entering St. Helena.", "possible_bannees": []}, "Slovenia": {"published_date": "29.04.2020", "ISO2": "SI", "info": "1.Passengers are not allowed to enter Slovenia.-This does not apply to nationals and residents of Slovenia.-This does not apply to nationals of Andorra, Monaco, Montenegro, North Macedonia (Rep.), San Marino, Serbia and Vatican City (Holy See) returning via Slovenia to their country of residence.-This does not apply to passengers with diplomatic passports.2.Nationals and residents of Slovenia are required to self-isolate for a period of 7 days.", "possible_bannees": ["AD", "MC", "ME", "SM", "RS"]}, "Slovakia": {"published_date": "07.05.2020", "ISO2": "SK", "info": "1.Passengers are not allowed to enter Slovakia.- This does not apply to nationals and residents of Slovakia2.Nationals and residents of Slovakia must register at least 72 hours prior to arrival at https://navraty.mzv.sk/?lang=en 3.Upon arrival returning nationals and residents of Slovakia are subject to Coronavirus (COVID-19) tests at the official state sanitary facility. Based on tests results, passengers must be in quarantine: - at home for a total of 14 days, including time spent at the state sanitary facility, or- at state sanitary facility where the quarantine time could be longer than 14 days.", "possible_bannees": []}, "Sierra Leone": {"published_date": "26.03.2020", "ISO2": "SL", "info": "1. Passengers who have transited through or have been in any country with 50 or more confirmed cases of Coronavirus (COVID-19) in the past 14 days are required to enter facility quarantine for maximum 14 days.2. Passengers who have transited through or have been in any country with less than 50 confirmed cases of Coronavirus (COVID-19) in the past 14 days are required to undergo home quarantine for maximum 14 days.", "possible_bannees": []}, "San Marino": {"published_date": "13.05.2020", "ISO2": "SM", "info": "1. Passengers are not allowed to enter Italy.- This does not apply to:- nationals or residents of Italy;- passengers traveling on business;- passengers traveling for urgent health reasons;- healthcare personnel traveling on duty;- passengers traveling for emergency reasons;- passengers returning via Italy to their country of residence. 2. Passengers allowed to enter Italy must present a completed self-declaration form to the transporting carrier; and- must communicate their entry to the Department of Prevention at local health units (ASL) of the entrance district; and- are subject to health surveillance and isolation for 14 days. This does not apply to passengers traveling on business if their stay in Italy does not exceed 72 hours and if granted, the additional 48 hours of a justified extension for specific needs.", "possible_bannees": ["IT"]}, "Senegal": {"published_date": "16.04.2020", "ISO2": "SN", "info": "Flights to Senegal are suspended.", "possible_bannees": []}, "Somalia": {"published_date": "16.03.2020", "ISO2": "SO", "info": "Passengers arriving from China (People's Rep.), Iran, Italy or Korea (Rep.) are not allowed to enter Somalia.", "possible_bannees": ["CN", "IT"]}, "Suriname": {"published_date": "09.04.2020", "ISO2": "SR", "info": "Airports in Suriname are closed.", "possible_bannees": []}, "South Sudan": {"published_date": "22.04.2020", "ISO2": "SS", "info": "Flights to South Sudan are suspended.- This does not apply to humanitarian and evacuation flights with an approval from the High Level Task Force of South Sudan.", "possible_bannees": []}, "El Salvador": {"published_date": "17.04.2020", "ISO2": "SV", "info": "El Salvador (SAL) is closed.- This does not apply to US military flights (CSL), humanitarian aid flights, ambulance flights, ferry/maintenance flights, repatriation flights with a special clearance. ", "possible_bannees": []}, "Sint Maarten (Dutch part)": {"published_date": "10.04.2020", "ISO2": "SX", "info": "Passengers and airline crew are not allowed to enter St. Maarten. - This does not apply to passengers who are specialists with evidence of traveling at the invitation of the Government of St. Maarten.- This does not apply to emergency and essential flights from Aruba, Curacao, Bonaire, St. Eustatius and Saba.", "possible_bannees": ["AW"]}, "Eswatini": {"published_date": "24.04.2020", "ISO2": "SZ", "info": "Passengers will be subject to self-isolation or mandatory 14-day quarantine in designated locations.", "possible_bannees": []}, "Turks and Caicos Islands": {"published_date": "10.04.2020", "ISO2": "TC", "info": "Airports in Turks and Caicos Isl. are closed. ", "possible_bannees": []}, "Chad": {"published_date": "26.04.2020", "ISO2": "TD", "info": "Airports in Chad are closed.", "possible_bannees": []}, "Togo": {"published_date": "25.04.2020", "ISO2": "TG", "info": "Flights to Togo are suspended.- This does not apply to repatriation flights.", "possible_bannees": []}, "Thailand": {"published_date": "27.04.2020", "ISO2": "TH", "info": "Flights to Thailand are suspended.- This does not apply to state or military aircraft, emergency landing, technical landing without disembarkation, humanitarian aid, medical, relief and repatriation flights. Passengers are subject to quarantine for 14 days upon arrival. Airline crew must observe self-quarantine during their stay until the next flight schedule.", "possible_bannees": []}, "Tajikistan": {"published_date": "19.03.2020", "ISO2": "TJ", "info": "Passengers who have been in Afghanistan, Belgium, China (People's Rep.), Denmark, Germany, Great Britain, Iran, Italy, France, Korea (Rep.), Spain, Sweden, Switzerland, Norway, the Netherlands or USA will be quarantined for up to 14 days upon arrival.", "possible_bannees": ["AF", "BE", "CN", "DK", "FR", "DE", "IT", "NO", "ES", "SE", "CH"]}, "Timor-Leste": {"published_date": "11.05.2020", "ISO2": "TL", "info": "1. Passengers are not allowed to enter Timor-Leste.- This does not apply to oil rig workers. 2 .Passengers are subject to health screening and to quarantine for 14 days.", "possible_bannees": []}, "Turkmenistan": {"published_date": "17.04.2020", "ISO2": "TM", "info": "1. Flights to Turkmenistan are suspended.- This does not apply to repatriation flights of nationals and residents of Turkmenistan.2. Passengers are required to have a health report from the health organizations of the country they are arriving from. The report must show that they have undergone the Coronavirus (COVID-19) check and been tested negative.", "possible_bannees": []}, "Tunisia": {"published_date": "04.05.2020", "ISO2": "TN", "info": "All flights to Tunisia are suspended.- This does not apply to:a. aircraft in a state of emergency;b. overflights;c. operations related to humanitarian aid, medical and relief flights;d. repatriation flights (only for nationals and permanent residents of Tunisia) - they will be placed in quarantine for 14 days;e. technical landings where passengers do not disembark;f. other safety-related operations.All the exceptions above are subject to prior request addressed to the Tunisian Civil Aviation Authority.", "possible_bannees": []}, "Tonga": {"published_date": "27.02.2020", "ISO2": "TO", "info": "1. Passengers and airline crew arriving from or transiting through China (People's Rep.), Chinese Taipei, Hong Kong (SAR China) or Macao (SAR China) are not allowed to enter Tonga. This does not apply if they have stayed in a country with no confirmed cases of Coronavirus (COVID-19) for a period of minimum 14 days before entering Tonga. They must have an official medical clearance undertaken within 3 days prior to arrival in Tonga. - This does not apply to nationals of Tonga and their immediate family members. - This does not apply to permanent residents of Tonga and their immediate family members. - This does not apply to airline crew on direct flights from China (People's Rep.) who have been using appropriate personal protective equipment (PPE). 2. Passengers must complete a 'Traveler's Arrival Health Declaration Card' and submit it to the Ministry of Health Border Control when arriving in Tonga.", "possible_bannees": ["CN", "HK", "MO"]}, "Turkey": {"published_date": "04.05.2020", "ISO2": "TR", "info": "1. Nationals of Algeria, Angola, Austria, Azerbaijan, Bangladesh, Belgium, Bulgaria, Cameroon, Canada, Chad, China (People's Rep.), Colombia, Cote d'Ivoire, Czechia, Denmark, Djibouti, Dominica, Ecuador, Egypt, Equatorial Guinea, Finland, France, Georgia, Germany, Greece. Guatemala, Hungary, India, Iran, Iraq, Ireland (Rep.), Italy, Jordan, Kazakhstan, Kenya, Korea (Rep.), Kosovo, Kuwait, Latvia, Lebanon, Mauritania, Moldova, Mongolia, Montenegro, Morocco, Nepal, Netherlands, Niger, North Macedonia (Rep.), Norway, Oman, Panama, Peru, Philippines, Poland, Portugal, Saudi Arabia, Slovenia, Spain, Sri Lanka, Sudan, Sweden, Switzerland, Tunisia, Ukraine, United Arab Emirates and Uzbekistan are not allowed to enter Turkey. 2. Passengers with a British passport are not allowed to enter Turkey.3. Passengers with a Chinese Taipei (on the cover: Republic of China Taiwan) passport are not allowed to enter Turkey.4. Passengers who have transited or have been in Algeria, Angola, Austria, Azerbaijan, Bangladesh, Belgium, Bulgaria, Cameroon, Canada, Chad, China (People's Rep.), Chinese Taipei, Colombia, Cote d'Ivoire, Czechia, Denmark, Djibouti, Dominica, Ecuador, Egypt, Equatorial Guinea, Finland, France, Georgia, Germany, Greece, Guatemala, Hungary, India, Iran, Iraq, Ireland (Rep.), Italy, Jordan, Kazakhstan, Kenya, Korea (Rep.), Kosovo, Kuwait, Latvia, Lebanon, Mauritania, Moldova, Mongolia, Montenegro, Morocco, Nepal, Netherlands, Niger, North Macedonia (Rep.), Norway, Oman, Panama, Peru, Philippines, Poland, Portugal, Saudi Arabia, Slovenia, Spain, Sri Lanka, Sudan, Sweden, Switzerland, Tunisia, Ukraine, United Arab Emirates, United Kingdom or Uzbekistan in the past 14 days are not allowed to transit or enter Turkey. 5. Passengers arriving from Algeria, Angola, Austria, Azerbaijan, Bangladesh, Belgium, Bulgaria, Cameroon, Canada, Chad, China (People's Rep.), Chinese Taipei, Colombia, Cote d'Ivoire, Czechia, Denmark, Djibouti, Dominica, Ecuador, Egypt, Equatorial Guinea, Finland, France, Georgia, Germany, Greece, Guatemala, Hungary, India, Iran, Iraq, Ireland (Rep.), Italy, Jordan, Kazakhstan, Kenya, Korea (Rep.), Kosovo, Kuwait, Latvia, Lebanon, Mauritania, Moldova, Mongolia, Montenegro, Morocco, Nepal, Netherlands, Niger, North Macedonia (Rep.), Norway, Oman, Panama, Peru, Philippines, Poland, Portugal, Saudi Arabia, Slovenia, Spain, Sri Lanka, Sudan, Sweden, Switzerland, Tunisia, Ukraine, United Arab Emirates, United Kingdom or Uzbekistan in the past 14 days are not allowed to transit or enter Turkey.6. All passengers who traveled to the above restricted countries during the last 14 days are prohibited to be accepted to all flights to Turkey. Otherwise, all passengers on the flights will be quarantined for 14 days.", "possible_bannees": ["DZ", "AO", "AT", "AZ", "BD", "BE", "BG", "CM", "CA", "TD", "CN", "CO", "CZ", "DK", "DJ", "DM", "EC", "EG", "GQ", "FI", "FR", "GE", "DE", "GR", "GT", "GN", "HU", "IN", "IQ", "IE", "IT", "JO", "KZ", "KE", "KW", "LV", "LB", "MR", "MN", "ME", "MA", "NP", "NO", "OM", "PA", "PE", "PL", "PT", "SA", "SI", "ES", "LK", "SE", "CH", "TN", "UA", "UZ"]}, "Trinidad and Tobago": {"published_date": "30.03.2020", "ISO2": "TT", "info": "Airports in Trinidad and Tobago are closed.- This does not apply if permitted by the Minister with responsibility for national security.", "possible_bannees": []}, "Tuvalu": {"published_date": "26.03.2020", "ISO2": "TV", "info": "Tuvalu's borders are closed.", "possible_bannees": []}, "Taiwan, Province of China": {"published_date": "01.05.2020", "ISO2": "TW", "info": "1. Passengers are not allowed to transit Chinese Taipei. 2. Passengers are not allowed to enter Chinese Taipei.- This does not apply to passengers with a Chinese Taipei travel document.- This does not apply to passengers with an Alien Resident Certificate.- This does not apply to personnel on diplomatic or official business.- This does not apply to passengers who can prove they are fulfilling commercial and contractual obligations, or passengers requiring special permission. - This does not apply to passengers with a visa with \"SPECIAL ENTRY PERMIT FOR COVID-19 OUTBREAK\" stated on remarks. 3. Passengers allowed to enter must observe a 14-day home quarantine upon arrival.4. All arriving passengers and crew members must present a completed Health Declaration Form.", "possible_bannees": []}, "Tanzania, United Republic of": {"published_date": "19.05.2020", "ISO2": "TZ", "info": "1. Passengers are subject to medical screening upon arrival. 2. Airline crew are subject to medical screening upon arrival and will be isolated if they are suspected of Coronavirus (COVID-19) infection. 3. Airline crew arriving in Zanzibar (ZNZ) will be quarantined at the airlines designated hotels. 4. A completed \"Health Form\" must be presented to the Ministry of Health personnel upon arrival.  ", "possible_bannees": []}, "Ukraine": {"published_date": "02.04.2020", "ISO2": "UA", "info": "Flights to Ukraine are suspended. ", "possible_bannees": []}, "Uganda": {"published_date": "22.04.2020", "ISO2": "UG", "info": "1. Flights to Uganda are suspended.This does not apply to:a. aircraft in a state of emergency;b. operations related to humanitarian aid, medical and relief flights;c. technical landings where passengers do not disembark;d. safety-related operation flights. 2. Airline crew members must undergo mandatory quarantine at Protea Hotel Entebbe.", "possible_bannees": []}, "United States": {"published_date": "14.05.2020", "ISO2": "US", "info": "1. Passengers who have transited or have been in Austria, Belgium, China (People's Rep.), Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden, Switzerland or in the United Kingdom (excluding overseas territories outside of Europe), in the past 14 days are not allowed to enter the USA.-This does not apply to:- nationals and permanent residents of the USA;- spouses of nationals and of permanent residents of the USA;- parents/legal guardians of an unmarried and younger than 21 years national or permanent resident of the USA;- the unmarried and younger than 21 years brother or sister of a national or permanent resident of the USA, who is unmarried and younger than 21 years;- the child/foster child/ward of a national or permanent resident of the USA;- passengers with the following visas: A-1, A-2, C-1, C-1/D, C-2, C-3, D, E-1, G-1, G-2, G-3, G-4, IR-4, IH-4, NATO-1 through NATO-4, or NATO-6 visa;- members of the U.S. Armed Forces, spouses, and children of members of the U.S. Armed Forces;- passengers with evidence of traveling at the invitation of the USA government for a purpose related to the containment/mitigation of the Coronavirus (COVID-19);- passengers with documents issued by the U.S. Department of Homeland Security, U.S. Customs and Border Protection, or U.S. Department of State indicating that the passenger is exempt from the restriction;- B1 crew crewmembers that are engaged in lightering, Outer Continental Shelf (OCS) activity, wind farm activity, private air/sea crew and other similar crewmember actives.2. Passengers who have been in one of the countries listed in bullet number 1 in the past 14 days but are exempt from the restriction to enter the USA, must arrive at one of the following airports: Atlanta (ATL), Boston (BOS), Chicago (ORD), Dallas, (DFW), Detroit (DTW), Honolulu (HNL), Los Angeles (LAX), Miami (MIA), New York (JFK or EWR), San Francisco (SFO), Seattle (SEA) and Washington (IAD).3. Passengers who have been in Austria, Belgium, China (People's Rep.), Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom (excluding overseas territories outside of Europe) in the past 14 days but are exempt from the restriction to enter the USA, must self-quarantine for 14 days once they reach their final destination.", "possible_bannees": ["AT", "BE", "CN", "CZ", "DK", "EE", "FI", "FR", "DE", "GR", "HU", "IS", "IE", "IT", "LV", "LI", "LT", "LU", "MT", "NO", "PL", "PT", "SK", "SI", "ES", "SE", "CH"]}, "Uruguay": {"published_date": "20.04.2020", "ISO2": "UY", "info": "Flights to Uruguay are suspended.- This does not apply to humanitarian flights. ", "possible_bannees": []}, "Uzbekistan": {"published_date": "24.03.2020", "ISO2": "UZ", "info": "Flights to Uzbekistan are suspended.", "possible_bannees": []}, "Holy See (Vatican City State)": {"published_date": "13.05.2020", "ISO2": "VA", "info": "1. Passengers are not allowed to enter Italy.- This does not apply to:- nationals or residents of Italy;- passengers traveling on business;- passengers traveling for urgent health reasons;- healthcare personnel traveling on duty;- passengers traveling for emergency reasons;- passengers returning via Italy to their country of residence. 2. Passengers allowed to enter Italy must present a completed self-declaration form to the transporting carrier; and- must communicate their entry to the Department of Prevention at local health units (ASL) of the entrance district; and- are subject to health surveillance and isolation for 14 days. This does not apply to passengers traveling on business if their stay in Italy does not exceed 72 hours and if granted, the additional 48 hours of a justified extension for specific needs.", "possible_bannees": ["IT"]}, "Saint Vincent and the Grenadines": {"published_date": "20.03.2020", "ISO2": "VC", "info": "Passengers who have been in China (People's Rep.), Hong Kong (SAR China), Japan, Korea (Rep.), Macao (SAR China) or Singapore in the past 14 days are not allowed to enter St. Vincent and the Grenadines.-This does not apply to nationals of St. Vincent and the Grenadines.", "possible_bannees": ["CN", "HK", "JP", "MO", "SG"]}, "Venezuela, Bolivarian Republic of": {"published_date": "09.04.2020", "ISO2": "VE", "info": "Flights to Venezuela are suspended.- This does not apply to humanitarian flights.", "possible_bannees": []}, "Virgin Islands, British": {"published_date": "17.04.2020", "ISO2": "VG", "info": "Airports are closed.", "possible_bannees": []}, "Virgin Islands, U.S.": {"published_date": "01.05.2020", "ISO2": "VI", "info": "Passengers are not allowed to enter Virgin Isl. (USA).- This does not apply to residents of Virgin Isl. (USA), medical personnel, passengers traveling for business and property owners.", "possible_bannees": []}, "Viet Nam": {"published_date": "01.04.2020", "ISO2": "VN", "info": "1. Passengers are not allowed to enter Viet Nam.- This does not apply to passengers on diplomatic or official duty. They will be subject to mandatory medical declaration and self-isolation.- This does not apply to passengers who are experts, business managers or highly skilled workers. They will be subject to mandatory medical declaration and self-isolation.- This does not apply to passengers approved by National Steering Committee on Covid-19 Prevention and Control.2. For transportation of nationals of Vietnam returning to Vietnam, airlines must contact the Vietnamese Diplomatic Representative agency in the local country in advance. Noi Bai International Airport (HAN) is temporarily suspending all flights.3. All passengers will be placed on quarantine at a designated facility for 14 days upon arrival. 4. All visa issuances are suspended.5. All passengers must fill out a quarantine form prior to arrival. 6. Passengers who travel for diplomatic or official purpose will undergo a medical examination at the border. 7. Nationals of Italy and Korea (Rep.) with a normal passport are no longer visa exempt. 8. Nationals of Denmark, Finland, France, Germany, Norway, Spain, Sweden and passengers with a British passport are no longer visa exempt.9. Passengers with a Certificate of Visa Exemption issued by Viet Nam are no longer visa exempt if they reside in China (People's Rep.), Denmark, Finland, France, Germany, Iran, Italy, Korea (Rep.), Norway, Spain, Sweden or United Kingdom. 10. Nationals of Belarus, Japan and Russian Fed. with a normal passport are no longer visa exempt.11. Nationals of Belarus, Japan and Russian Fed. with a normal passport and with a Certificate of Visa Exemption issued by Viet Nam are no longer visa exempt.12. Airline crew are subject to mandatory medical declaration as well as observing self-quarantine during their stay until the next flight schedule.", "possible_bannees": ["BY", "CN", "DK", "FI", "FR", "DE", "IT", "JP", "NO", "ES", "SE"]}, "Vanuatu": {"published_date": "30.03.2020", "ISO2": "VU", "info": "Vanuatu ports of entry are closed.", "possible_bannees": []}, "Wallis and Futuna": {"published_date": "01.04.2020", "ISO2": "WF", "info": "Flights to New Caledonia are suspended.", "possible_bannees": ["NC"]}, "Samoa": {"published_date": "21.03.2020", "ISO2": "WS", "info": "1. All travelers, including returning residents entering Samoa, must have a medical certificate issued by a registered medical practitioner issued within 3 days before their arrival into Samoa. 2. Passengers who have transited through or have been in Australia, Austria, Bahrain, Belgium, Canada, China (People’s Rep.), Chinese Taipei, Czechia, Denmark, France, Germany, Greece, Hong Kong (SAR China), Iceland, Italy, Iran, Japan, Korea (Rep.), Kuwait, Luxembourg, Macao (SAR China), Malaysia, Netherlands, Norway, Qatar, Singapore, Spain, Sweden, Switzerland, Thailand, United Arab Emirates or USA are not allowed to enter Samoa.Passengers must:a) Spend at least 14 days in self-quarantine in a country of last port and must have a Medical Clearance within (3) days prior to final route to Samoa. This must be their final stop before travelling to Samoa. b) Provide proof of test results done within 5 days for the Coronavirus (COVID-19). Passengers with Coronavirus (COVID-19) positive test will not be allowed to enter Samoa.3. All travelers, including returning residents entering Samoa, are required to undergo medical examination by a Registered Medical Practitioner within 3 days before arrival. Medical clearance report is required for check-in prior to issuing of boarding passes. 4. All travelers entering Samoa, including Samoan passport holders who are permanent residents of American Samoa, are required to have medical examination within 3 days before entering. It has to be signed by the attending physician and counter-signed by the Motusa Tuileama Nua, Director of Public Health, American Samoa. 5. Compulsory screening of all arriving passengers and crew to Samoa is in effect at all ports of entry. All are required to comply and produce additional documents when asked. 6. A Special Health Declaration Card has to be filled out by all passengers inflight or on arrival in to Samoa.", "possible_bannees": ["AS", "AU", "AT", "BH", "BE", "CA", "CN", "CZ", "DK", "FR", "DE", "GR", "HK", "IS", "IT", "JP", "KW", "LU", "MO", "MY", "NO", "QA", "SG", "ES", "SE", "CH", "TH"]}, "Mayotte": {"published_date": "06.05.2020", "ISO2": "YT", "info": "1. A completed International Travel Certificate must be presented prior to boarding and to Immigration upon arrival or when transiting Mayotte. The certificate must be obtained before departure via the French consular offices abroad or online at https://www.interieur.gouv.fr.2. Passengers must go through a medical examination upon arrival and are subject to quarantine for a period of 14 days.- This does not apply to healthcare professionals related to Coronavirus (COVID-19).", "possible_bannees": []}, "South Africa": {"published_date": "15.05.2020", "ISO2": "ZA", "info": "1. Flights to South Africa are suspended.- This does not apply to:- flights authorized by the ministry of transport;- flights bringing back nationals of South Africa. They will be quarantined for up to 21 days;- medical evacuation, aircrafts in state of emergency, air ambulance which must only carry airline crew and patients. They are subject to quarantine.2. Flights not mentionned above must obtain a written permission from the department of transport before departure.", "possible_bannees": []}, "Zambia": {"published_date": "27.03.2020", "ISO2": "ZM", "info": "1. All flights must arrive at Lusaka (LUN).2. Passengers and airline crew must quarantine for at least 14 days at their own costs.", "possible_bannees": []}, "Zimbabwe": {"published_date": "19.05.2020", "ISO2": "ZW", "info": "1. Except for BUQ, HRE and VFA, airports are closed.2. BUQ, HRE and VFA airports are open for the following flights:- flights carrying staff for essential services or sick persons to hospitals and other health care providers; - flights carrying a member of the staff of a foreign mission or agency going to or from such mission or agency, or a citizen, resident or protected subject of a foreign country going to or from a foreign mission of the country of which he or she is the citizen, resident or subject, for the purpose of obtaining services or assistance at such mission;- flights carrying police, defence forces personnel and other enforcement officers.If any new travel restrictions will be imposed, we will ensure that Timatic is updated accordingly. We are monitoring this outbreak very closely and we will keep you posted on the developments.", "possible_bannees": []}}, "scraping_error": []}